[
  {
    "course_id": "08-200",
    "title": "Ethics and Policy Issues in ComputingSpring: 9 units",
    "department": "School of Computer Science",
    "description": "In this course, students will study the social impacts of computing technology and systems. The course will provide a brief introduction to ethics and to the new and difficult ethical questions modern computing technology presents us with. It will focus on a number of areas in which computers and information technology are having an impact on society including data privacy, social media, and autonomous technologies.",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "08-722",
    "title": "Data Structures for Application ProgrammersFall and",
    "department": "School of Computer Science",
    "description": "This course is an introduction to Data Structures and a few fundamental algorithms for students with some prior programming experience (functions, loops and arrays mainly in Java). It covers the conceptual and implementation views of some common data structures and algorithms. It also goes over the Java Collections (such as List, ArrayList, LinkedList, Set, HashSet, TreeSet, Map, HashMap, TreeMap, PriorityQueue) to solidify the understanding of the data structures. There is an introduction to the analysis of algorithms that operate on them. Following learning-by-doing methodology, there will be many repetitions of writing code and reviews of the items covered in lectures. Students are required to be familiar with Java Programming before taking this course. Those who are not are encouraged ...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "07-070",
    "title": "Teaching Techniques for Computer ScienceFall and",
    "department": "School of Computer Science",
    "description": "This course is a broad introduction to teaching techniques and DEI issues in the context of computer science education. It is targeted to first-time undergraduate and graduate SCS TAs, with the goal of providing instruction, hands-on practice, and feedback to TAs to improve their instructional proficiency.",
    "units": 2,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "07-090",
    "title": "Artificial Intelligence PracticumAll Semesters: 3 units",
    "department": "School of Computer Science",
    "description": "This course is for Artificial Intelligence students who wish to have an internship experience as part of their curriculum. Students are required to write a one-page summary statement prior to registration that explains how their internship connects with their AI curriculum, specifically on how it uses material they have learned as well as prepares them for future courses. Near the end of the internship, students will be required to submit a reflection paper that describes the work they did in more detail, including lessons learned about the work experience and how they utilized their AI education to work effectively. International students should consult with the Office of International Education for appropriate paperwork and additional requirements before registration. Units earned count ...",
    "units": 3,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "07-120",
    "title": "Introduction to Software ConstructionFall and",
    "department": "School of Computer Science",
    "description": "Writing software can be very challenging. While software is often written to solve difficult problems, or implement complex algorithms, there are also challenges in the writing of software itself. In this course, students will learn the software construction skills that will help them throughout their career, both as students, and beyond. Students should expect to learn how to decompose an assignment/problem into subtasks, how to track their progress using milestones, evaluating sub regions of code for correctness, as well as finding and fixing faults in code. Students should expect to participate in a variety of in class activities, as well as work on a project implementing the skills they are learning in class. Prerequisite: [15-112](http://coursecatalog.web.cmu.edu/search/?P=15-112 \"15-...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "07-129",
    "title": "Freshmen Immigration CourseFall: 3 units",
    "department": "School of Computer Science",
    "description": "The Freshman Immigration Course is taken by first-semester Computer Science majors on the Doha campus. The course is designed to acquaint incoming majors with computer science at CMU. Talks range from historical perspectives in the field to descriptions of the cutting edge research being conducted in the School of Computer Science. Enrollment is limited to SCS Freshmen ONLY.",
    "units": 3,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "07-131",
    "title": "Great Practical Ideas for Computer ScientistsFall: 2 units",
    "department": "School of Computer Science",
    "description": "SECTION A IS OPEN TO SCS FIRST YEAR STUDENTS ONLY. Throughout your education as a Computer Scientist at Carnegie Mellon, you will take courses on programming, theoretical ideas, logic, systems, etc. As you progress, you will be expected to pick up the so-called \"tools of the trade.\" This course is intended to help you learn what you need to know in a friendly, low-stress, high-support way. We will discuss UNIX, LaTeX, debugging and many other essential tools. Laptop required. Only undergraduate students will be able to enroll in this course.",
    "units": 2,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "07-135",
    "title": "Grand Challenge First-Year Seminar: Designing Better Human-AI FuturesSpring: 9 units",
    "department": "School of Computer Science",
    "description": "This course will explore the societal impacts of artificial intelligence (AI) based decision-making systems, especially focusing on the societal biases they may enhance or reduce. Students will gain a fundamental understanding of how these systems are designed and work, as well as the role of data in mitigating or enhancing biases. The course is multidisciplinary in nature and brings together social scientists, engineers, data scientists, and designers to tackle the grand challenge of dealing with issues of bias and fairness in Human-AI collaborative systems, ranging from the data that is used to train them, to their human creators that are responsible for deciding how they work and get used. Students will investigate policy, technology and societal elements aimed at reducing and mitigatin...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "07-180",
    "title": "Concepts in Artificial IntelligenceSpring: 5 units",
    "department": "School of Computer Science",
    "description": "The course will introduce students to the main foundational concepts and techniques used in Artificial Intelligence (AI), including representation, heuristic search, probabilistic reasoning, decision making, and machine learning. Concepts will be grounded in a range of real-world applications in which AI is currently used. Students will be introduced to ethical issues surrounding AI, as well as the potential future of a world in which AI is commonplace. Programming and written assignments will enable students to get a feel for how to implement and use AI techniques. Prerequisites: [15-112](http://coursecatalog.web.cmu.edu/search/?P=15-112 \"15-112\") or [15-122](http://coursecatalog.web.cmu.edu/search/?P=15-122 \"15-122\") Course Website: [https://canvas.cmu.edu/courses/8266](https://canvas.cm...",
    "units": 5,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "07-380",
    "title": "Artificial Intelligence and Machine Learning IIFall and",
    "department": "School of Computer Science",
    "description": "Continuation of artificial intelligence and machine learning.",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "07-400",
    "title": "Research Practicum in Computer ScienceSpring: 12 units",
    "department": "School of Computer Science",
    "description": "This Spring course is the second part of a two-course sequence that is designed to help prepare students to invent the future state-of-the-art in the field of computer science. Building directly upon 15-300 (the prerequisite for this course), students will conduct a semester-long independent research project, under the guidance of both the course staff and a faculty project mentor. The course does not meet for lecture or recitations. Instead, the students will spend their time working on their research projects, and will also meet with course staff on a bi-weekly basis to discuss their progress. Students will prepare a written report and a poster presentation at the end of the semester to describe what they have accomplished. Prerequisites: [07-300](http://coursecatalog.web.cmu.edu/search/...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "07-402",
    "title": "SCS Leadership Development SeminarFall and",
    "department": "School of Computer Science",
    "description": "This course is designed for 3rd-year and 4th-year School of Computer Science students committed to further developing their leadership skills and potential for sustained impact in the future. The course will be substantive and engaging, while also ideally thought provoking, edifying, and enjoyable. The course will build on the foundation of six key leadership pillars, identified to hone each students professional and personal development to serve others, and to seek out and nurture opportunities to heighten ones capacity as a person and leader who is: VISIONARY, with clear goals for yourself, your organizations and communities, and others in whose lives you are a part, including the broader society; ETHICAL, with core values and steadfastness in the face of competing objectives, and the re...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "07-590",
    "title": "Independent Study in CS Education (Undergraduate)Fall and Spring",
    "department": "School of Computer Science",
    "description": "Description: An independent study course to allow motivated students to work on CS education projects under the supervision of a faculty advisor. Includes the development of a pedagogical study, reading of research papers or texts on CS education, or other suitable activities to learn about the teaching of computer science. Presentation of research or study results required. Independent studies are usually one semester in duration and require prior approval from the faculty advisor and the School of Computer Science.",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "07-599",
    "title": "SCS Honors Undergraduate Research ThesisFall and Spring",
    "department": "School of Computer Science",
    "description": "Available only to students registered in the CS Senior Research Thesis Program.",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "07-690",
    "title": "Independent Study in CS Education (Masters)Fall and Spring",
    "department": "School of Computer Science",
    "description": "Description: An independent study course to allow motivated students to work on CS education projects under the supervision of a faculty advisor. Includes the development of a pedagogical study, reading of research papers or texts on CS education, or other suitable activities to learn about the teaching of computer science. Presentation of research or study results required. Independent studies are usually one semester in duration and require prior approval from the faculty advisor and the School of Computer Science.",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-112",
    "title": "Programming for ScientistsIntermittent: 12 units",
    "department": "School of Computer Science",
    "description": "Provides a practical introduction to programming for students with little or no prior programming experience who are interested in science. Fundamental scientific algorithms will be introduced, and extensive programming assignments will be based on analytical tasks that might be faced by scientists, such as parsing, simulation, and optimization. Principles of good software engineering will also be stressed. The course will introduce students to the Go programming language, an industry-supported, modern programming language, the syntax of which will be covered in depth. Other assignments will be given in other programming languages such as Python and Java to highlight the commonalities and differences between languages. No prior programming experience is assumed, and no biology background i...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-120",
    "title": "Undergraduate Programming for ScientistsAll Semesters: 12 units",
    "department": "School of Computer Science",
    "description": "Undergraduate Programming for Scientists",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-135",
    "title": "Ethics in the Practice of Computational BiologyAll Semesters: 12 units",
    "department": "School of Computer Science",
    "description": "Advances in biotechnology and machine learning have rapidly expanded the role that computation plays in basic biology and in medicine. The new ways in which computational biology is applied have created new ethical considerations across the field. This goal of this course is to create awareness of new ethical considerations in computational biology and to provide a forum for the discussion of those issues. The course will consist of series of structured discussions around emerging topics in the field. Specific topics include commercialization of personal genetic data, ethics issues in conservation genomics, and the rise of consortium science.",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-180",
    "title": "Great Ideas in Computational Biology ISpring: 5 units",
    "department": "School of Computer Science",
    "description": "This course introduces great ideas that have formed the foundation for the recent transformation of life sciences into a fully-fledged computational discipline. Extracting biological understanding from both large and small data sets now requires the use and design of novel algorithms, developed in the field of computational biology. The course is designed as a gateway exposure to computational biology for first-year undergraduates in the School of Computer Science, although it is open to other computationally minded students who are interested in exploring the field. This course is the first in a two-course sequence, showing students fundamental algorithmic techniques that are used in modern biological investigations. This first course focuses on algorithmic techniques for genomics, or the...",
    "units": 5,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-181",
    "title": "Great Ideas in Computational Biology IISpring: 5 units",
    "department": "School of Computer Science",
    "description": "This course introduces great ideas that have formed the foundation for the recent transformation of life sciences into a fully-fledged computational discipline. Extracting biological understanding from both large and small data sets now requires the use and design of novel algorithms, developed in the field of computational biology. This course is the second in a two-course sequence, offering a gateway exposure for students showing fundamental algorithmic techniques that are used in modern biological investigations. It is designed for first-year undergraduates in the School of Computer Science, although it is open to other computationally minded students who are interested in exploring the field. Whereas the first course in the sequence focuses on genomics, this second course largely intro...",
    "units": 5,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-218",
    "title": "Introduction to Computational MedicineAll Semesters: 3 units",
    "department": "School of Computer Science",
    "description": "This course is an introduction to computational methods relevant to the diagnosis and treatment of human diseases. It is the microcourse version of [02-518](http://coursecatalog.web.cmu.edu/search/?P=02-518 \"02-518\"), Computational Medicine. The course begins with an introduction to the field of Medicine, and an overview of the primary clinical tasks associated with Computational Medicine (phenotyping; biomarker discovery; predictive modeling). Next, we provide an introduction to several Machine Learning techniques, and how those techniques can be used to perform the clinical tasks. For the remainder of the course, students will be guided through the analysis of a clinical data set to gain experience with these techniques. No prior experience with Medicine, Machine Learning, or computer pr...",
    "units": 3,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-223",
    "title": "Personalized Medicine: Understanding Your Own GenomeFall: 9 units",
    "department": "School of Computer Science",
    "description": "Do you want to know how to discover the tendencies hidden in your genome? Since the first draft of a human genome sequence became available at the start of this century, the cost of genome sequencing has decreased dramatically. Personal genome sequencing will likely become a routine part of medical exams for patients for prognostic and diagnostic purposes. Personal genome information will also play an increasing role in lifestyle choices, as people take into account their own genetic tendencies. Commercial services such as 23andMe have already taken first steps in this direction. Computational methods for mining large-scale genome data are being developed to unravel the genetic basis of diseases and assist doctors in clinics. This course introduces students to biological, computational, an...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-250",
    "title": "Introduction to Computational BiologySpring: 12 units",
    "department": "School of Computer Science",
    "description": "This class provides a general introduction to computational tools for biology. The course is divided into two halves. The first half covers computational molecular biology and genomics. It examines important sources of biological data, how they are archived and made available to researchers, and what computational tools are available to use them effectively in research. In the process, it covers basic concepts in statistics, mathematics, and computer science needed to effectively use these resources and understand their results. Specific topics covered include sequence data, searching and alignment, structural data, genome sequencing, genome analysis, genetic variation, gene and protein expression, and biological networks and pathways. The second half covers computational cell biology, inc...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-261",
    "title": "Quantitative Cell and Molecular Biology LaboratoryFall and Spring",
    "department": "School of Computer Science",
    "description": "This is an introductory laboratory-based course designed to teach basic biological laboratory skills used in exploring the quantitative nature of biological systems and the reasoning required for performing research in computational biology. Over the course of the semester, students will design and perform multiple modern experiments and quantitatively analyze the results of these experiments. During this course students will also have an opportunity to use techniques learned during the course to experimentally answer an open question. Designing the experiments will require students to think critically about the biological context of the experiments as well as the necessary controls to ensure interpretable experimental results. During this course students will gain experience in many aspec...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-317",
    "title": "Algorithms in NatureIntermittent: 9 units",
    "department": "School of Computer Science",
    "description": "Computer systems and biological processes often rely on networks of interacting entities to reach joint decisions, coordinate and respond to inputs. There are many similarities in the goals and strategies of biological and computational systems which suggest that each can learn from the other. These include the distributed nature of the networks (in biology molecules, cells, or organisms often operate without central control), the ability to successfully handle failures and attacks on a subset of the nodes, modularity and the ability to reuse certain components or sub-networks in multiple applications and the use of stochasticity in biology and randomized algorithms in computer science. In this course we will start by discussing classic biologically motivated algorithms including neural ne...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-331",
    "title": "Modeling EvolutionSpring: 12 units",
    "department": "School of Computer Science",
    "description": "Some of the most serious public health problems we face today, from drug-resistant bacteria, to cancer, all arise from a fundamental property of living systems and #8212; their ability to evolve. Since Darwin's theory of natural selection was first proposed, we have begun to understand how heritable differences in reproductive success drive the adaptation of living systems. This makes it intuitive and tempting to view evolution from an optimization perspective. However, genetic drift, phenotypic trade-offs, constraints, and changing environments, are among the many factors that may limit the optimizing force of natural selection. This tug-of-war between selection and drift, between the forces that produce variation in a population, and the forces suppressing this variation, make evolutiona...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-402",
    "title": "Computational Biology SeminarFall and",
    "department": "School of Computer Science",
    "description": "This course consists of weekly invited presentations on current computational biology research topics by leading scientists. Attendance is mandatory for a passing grade. You must sign in and attend at least 80% of the seminars. See course website for seminar locations. Some will be at the University of Pittsburgh and some will be at Carnegie Mellon.",
    "units": 3,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-403",
    "title": "Special Topics: Graph Representation Learning in BiologyIntermittent: 12 units",
    "department": "School of Computer Science",
    "description": "Biological and cellular systems are often modeled as graphs (networks) of interacting elements. This approach has been highly successful owing to the theory, methodology and algorithms that support analysis and learning on graphs. However, recent advances in deep learning techniques have led to a surge in research on graph representation learning. In particular, these advances have led to new state-of-the-art results in biomedicine and healthcare. This course will provide a synthesis and overview of graph representation learning within systems biology and medicine. We will begin with a discussion of the goals of graph representation learning, as well as key methodological foundations in graph theory and network analysis. We next review traditional methods such as topological descriptors, g...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-414",
    "title": "String AlgorithmsIntermittent: 12 units",
    "department": "School of Computer Science",
    "description": "Provides an in-depth look at modern algorithms used to process string data, particularly those relevant to genomics. The course will cover the design and analysis of efficient algorithms for processing enormous amounts of collections of strings. Topics will include string search; inexact matching; string compression; string data structures such as suffix trees, suffix arrays, and searchable compressed indices; and the Borrows-Wheeler transform. Applications of these techniques in genomics will be presented, including genome assembly, transcript assembly, whole-genome alignment, gene expression quantification, read mapping, and search of large sequence databases. Prerequisites: [21-128](http://coursecatalog.web.cmu.edu/search/?P=21-128 \"21-128\") or [15-151](http://coursecatalog.web.cmu.edu/...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-421",
    "title": "Algorithms for Computational Structural BiologyIntermittent: 12 units",
    "department": "School of Computer Science",
    "description": "Some of the most interesting and difficult challenges in computational biology and bioinformatics arise from the determination, manipulation, or exploitation of molecular structures. This course will survey these challenges and present a variety of computational methods for addressing them. Topics will include: molecular dynamics simulations, computer-aided drug design, and computer-aided protein design. The course is appropriate for both students with backgrounds in computer science and those in the life sciences.",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-425",
    "title": "Computational Methods for Proteogenomics and MetabolomicsSpring: 9 units",
    "department": "School of Computer Science",
    "description": "Proteomics and metabolomics are the large scale study of proteins and metabolites, respectively. In contrast to genomes, proteomes and metabolomes vary with time and the specific stress or conditions an organism is under. Applications of proteomics and metabolomics include determination of protein and metabolite functions (including in immunology and neurobiology) and discovery of biomarkers for disease. These applications require advanced computational methods to analyze experimental measurements, create models from them, and integrate with information from diverse sources. This course specifically covers computational mass spectrometry, structural proteomics, proteogenomics, metabolomics, genome mining and metagenomics. Prerequisites: [02-604](http://coursecatalog.web.cmu.edu/search/?P=0...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-500",
    "title": "Undergraduate Research in Computational BiologyFall and Spring",
    "department": "School of Computer Science",
    "description": "This course is for undergraduate students who wish to do supervised research for academic credit with a Computational Biology faculty member. Interested students should first contact the Professor with whom they would like to work. If there is mutual interest, the Professor will direct you to the Academic Programs Coordinator who will enroll you in the course. [02-250](http://coursecatalog.web.cmu.edu/search/?P=02-250 \"02-250\") is a suggested pre-requisite. Course Website: [https://forms.gle/S1AJX65btkTxwNCw9](https://forms.gle/S1AJX65btkTxwNCw9)02-510 Computational GenomicsSpring: 12 units Dramatic advances in experimental technology and computational analysis are fundamentally transforming the basic nature and goal of biological research. The emergence of new frontiers in biology, such a...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-512",
    "title": "Computational Methods for Biological Modeling and SimulationFall: 9 units",
    "department": "School of Computer Science",
    "description": "This course covers a variety of computational methods important for modeling and simulation of biological systems. It is intended for graduates and advanced undergraduates with either biological or computational backgrounds who are interested in developing computer models and simulations of biological systems. The course will emphasize practical algorithms and algorithm design methods drawn from various disciplines of computer science and applied mathematics that are useful in biological applications. The general topics covered will be models for optimization problems, simulation and sampling, and parameter tuning. Course work will include problem sets with significant programming components and independent or group final projects. Prerequisites: (36-217 or [15-259](http://coursecatalog.we...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-514",
    "title": "String AlgorithmsFall: 12 units",
    "department": "School of Computer Science",
    "description": "Provides an in-depth look at modern algorithms used to process string data, particularly those relevant to genomics. The course will cover the design and analysis of efficient algorithms for processing enormous collections of strings. Topics will include string search; inexact matching; string compression; string data structures such as suffix trees, suffix arrays, and searchable compressed indices; and the Burrows-Wheeler transform. Applications of these techniques in biology will be presented, including genome assembly, transcript assembly, whole-genome alignment, gene expression quantification, read mapping, and search of large sequence databases. No knowledge of biology is assumed, and the topics covered will be of use in other fields involving large collections of strings. Programming...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-518",
    "title": "Computational MedicineFall: 12 units",
    "department": "School of Computer Science",
    "description": "Modern medical research increasingly relies on the analysis of large patient datasets to enhance our understanding of human diseases. This course will focus on the computational problems that arise from studies of human diseases and the translation of research to the bedside to improve human health. The topics to be covered include computational strategies for advancing personalized medicine, pharmacogenomics for predicting individual drug responses, metagenomics for learning the role of the microbiome in human health, mining electronic medical records to identify disease phenotypes, and case studies in complex human diseases such as cancer and asthma. We will discuss how machine learning methodologies such as regression, classification, clustering, semi-supervised learning, probabilistic ...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-543",
    "title": "Graph Representation Learning in BiologyIntermittent: 12 units",
    "department": "School of Computer Science",
    "description": "Biological and cellular systems are often modeled as graphs (networks) of interacting elements. This approach has been highly successful owing to the theory, methodology and algorithms that support analysis and learning on graphs. However, recent advances in deep learning techniques have led to a surge in research on graph representation learning. In particular, these advances have led to new state-of-the-art results in biomedicine and healthcare. This course will provide a synthesis and overview of graph representation learning within systems biology and medicine. We will begin with a discussion of the goals of graph representation learning, as well as key methodological foundations in graph theory and network analysis. We next review traditional methods such as topological descriptors, g...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-544",
    "title": "Introduction to Statistical GeneticsIntermittent: 12 units",
    "department": "School of Computer Science",
    "description": "This course will cover quantitative topics in human statistical genetics, including the HapMap project, linkage disequilibrium, population structure and stratification, natural selection, genome-wide association studies, estimating and partitioning heritability, association testing, statistical fine-mapping, disease gene mapping, expression quantitative trait loci, single-cell genomics, and polygenic risk prediction. The course will emphasize hands-on analysis of large empirical data sets, thus requiring prior experience with a general-purpose high-level programming language such as Python. After taking this course, each student will have the experience and skills to develop and apply statistical methods to population genetic data. Prerequisites: ( [02-120](http://coursecatalog.web.cmu.edu...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-601",
    "title": "Programming for ScientistsFall and",
    "department": "School of Computer Science",
    "description": "Provides a practical introduction to programming for students with little previous programming experience who are interested in science. Fundamental scientific algorithms will be introduced, and extensive programming assignments will be based on analytical tasks that might be faced by scientists, such as parsing, simulation, and optimization. Principles of good software engineering will also be stressed. The course will introduce students to the Go programming language, an industry-supported, modern programming language, the syntax of which will be covered in depth. Other assignments may be given in other programming languages to highlight the commonalities and differences between languages. No biology background is needed. Analytical skills, an understanding of programming basics, and mat...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-602",
    "title": "Professional Issues for Computational and Automated ScientistsFall and",
    "department": "School of Computer Science",
    "description": "This course gives Master's in Computational Biology and Master's in Automated Science students the opportunity to develop the professional skills necessary for a successful career in either academia or industry. This course, required in the first semester of both programs, will include assistance with elevator pitches, interview preparation, resume and cover letter writing, networking, and presentation skills. The course will also include opportunities to connect with computational biology professionals as part of industry outreach. The course will meet once a week and is pass/fail only.",
    "units": 3,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-604",
    "title": "Fundamentals of BioinformaticsSpring: 12 units",
    "department": "School of Computer Science",
    "description": "How do we find potentially harmful mutations in your genome? How can we reconstruct the Tree of Life? How do we compare similar genes from different species? These are just three of the many central questions of modern biology that can only be answered using computational approaches. This 12-unit course will delve into some of the fundamental computational ideas used in biology and let students apply existing resources that are used in practice every day by thousands of biologists. The course offers an opportunity for students who possess an introductory programming background to become more experienced coders within a biological setting. As such, it presents a natural next course for students who have completed [02-601](http://coursecatalog.web.cmu.edu/search/?P=02-601 \"02-601\").",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-605",
    "title": "Professional Issues in Automated ScienceSpring: 3 units",
    "department": "School of Computer Science",
    "description": "This course gives MS in Automated Science students an opportunity to develop professional skills necessary for a successful career in computational biology. This course will include assistance with resume writing, interview preparation, presentation skills, and job search techniques. This course will also include opportunities to network with computational biology professionals and academic researchers.",
    "units": 3,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-613",
    "title": "Algorithms and Advanced Data StructuresFall and",
    "department": "School of Computer Science",
    "description": "The objective of this course is to study algorithms for general computational problems, with a focus on the principles used to design those algorithms. Efficient data structures will be discussed to support these algorithmic concepts. Topics include: Run time analysis, divide-and-conquer algorithms, dynamic programming algorithms, network flow algorithms, linear and integer programming, large-scale search algorithms and heuristics, efficient data storage and query, and NP-completeness. Although this course may have a few programming assignments, it is primarily not a programming course. Instead, it will focus on the design and analysis of algorithms for general classes of problems. This course is not open to CS graduate students who should consider taking 15-651 instead. [02-250](http://co...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-614",
    "title": "String AlgorithmsIntermittent: 12 units",
    "department": "School of Computer Science",
    "description": "Provides an in-depth look at modern algorithms used to process string data, particularly those relevant to genomics. The course will cover the design and analysis of efficient algorithms for processing enormous amounts of collections of strings. Topics will include string search; inexact matching; string compression; string data structures such as suffix trees, suffix arrays, and searchable compressed indices; and the Borrows-Wheeler transform. Applications of these techniques in genomics will be presented, including genome assembly, transcript assembly, whole-genome alignment, gene expression quantification, read mapping, and search of large sequence databases. Prerequisites: [15-151](http://coursecatalog.web.cmu.edu/search/?P=15-151 \"15-151\") or 15-127 or [21-128](http://coursecatalog.we...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-654",
    "title": "Biotechnology Enterprise DevelopmentFall: 12 units",
    "department": "School of Computer Science",
    "description": "In this course students learn how to develop a biotech start-up, create a Minimum Viable Product (MVP), business model and strategy for the product. Students will learn about business modeling, customer development, customer validation, proposal, product branding, and marketing for their product. The course will require students to spend most time to validate their start up concept and prototypes with potential customers and adapt to critical feedback and revise their respective value propositions accordingly. Students learn to balance technical product development with customer requirements, business strategy and budget constraints. This course provides real world, hands-on learning on what it is like to start a company. Different business modeling will be covered. By understand customer ...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-680",
    "title": "Essential Mathematics and Statistics for ScientistsFall: 9 units",
    "department": "School of Computer Science",
    "description": "This course rigorously introduces fundamental topics in mathematics and statistics to first-year master's students as preparation for more advanced computational coursework. Topics are sampled from information theory, graph theory, proof techniques, phylogenetics, combinatorics, set theory, linear algebra, neural networks, probability distributions and densities, multivariate probability distributions, maximum likelihood estimation, statistical inference, hypothesis testing, Bayesian inference, and stochastic processes. Students completing this course will obtain a broad skillset of mathematical techniques and statistical inference as well as a deep understanding of mathematical proof. They will have the quantitative foundation to immediately step into an introductory master's level machin...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-699",
    "title": "Independent Study in Computational BiologyFall and Spring",
    "department": "School of Computer Science",
    "description": "The student will, under the individual guidance of a faculty member, read and digest process papers or a textbook in an advanced area of computational biology not offered by an existing course at Carnegie Mellon. The student will demonstrate their mastery of the material by a combination of one or more of the following: oral discussions with the faculty member; exercises set by the faculty member accompanying the readings; and a written summary synthesizing the material that the student learned. Permission required.",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-700",
    "title": "M.S. Thesis ResearchFall and Spring",
    "department": "School of Computer Science",
    "description": "This course is for M.S. students who wish to do supervised research for academic credit with a Computational Biology faculty member. Interested students should first contact the Professor with whom they would like to work. If there is mutual interest, the Professor will direct you to the Academic Programs Coordinator, who will enroll you in the course. Course Website: [https://forms.gle/tDKDs1EujvXAApYK7](https://forms.gle/tDKDs1EujvXAApYK7)02-702 Computational Biology SeminarFall and Spring: 3 units This course consists of weekly invited presentations on current computational biology research topics by leading scientists. Attendance is mandatory for a passing grade. You must sign in and attend at least 80 percent of the seminars. See course website for seminar locations. Some will be at t...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-704",
    "title": "Special Topics: Introduction to Statistical GeneticsIntermittent: 12 units",
    "department": "School of Computer Science",
    "description": "This course will cover quantitative topics in human statistical genetics, including the HapMap project, linkage disequilibrium, population structure and stratification, natural selection, genome-wide association studies, estimating and partitioning heritability, association testing, statistical fine-mapping, disease gene mapping, expression quantitative trait loci, single-cell genomics, and polygenic risk prediction. The course will emphasize hands-on analysis of large empirical data sets, thus requiring prior experience with a general-purpose high-level programming language such as Python. After taking this course, each student will have the experience and skills to develop and apply statistical methods to population genetic data. Prerequisites: ( [02-601](http://coursecatalog.web.cmu.edu...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-710",
    "title": "Computational GenomicsSpring: 12 units",
    "department": "School of Computer Science",
    "description": "Dramatic advances in experimental technology and computational analysis are fundamentally transforming the basic nature and goal of biological research. The emergence of new frontiers in biology, such as evolutionary genomics and systems biology is demanding new methodologies that can confront quantitative issues of substantial computational and mathematical sophistication. From the computational side this course focuses on modern machine learning methodologies for computational problems in molecular biology and genetics, including probabilistic modeling, inference and learning algorithms, data integration, time series analysis, active learning, etc. This course counts as a CSD Applications elective",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-711",
    "title": "Computational Molecular Biology and GenomicsSpring: 12 units",
    "department": "School of Computer Science",
    "description": "An advanced introduction to computational molecular biology, using an applied algorithms approach. The first part of the course will cover established algorithmic methods, including pairwise sequence alignment and dynamic programming, multiple sequence alignment, fast database search heuristics, hidden Markov models for molecular motifs and phylogeny reconstruction. The second part of the course will explore emerging computational problems driven by the newest genomic research. Course work includes four to six problem sets, one midterm and final exam. Prerequisites: ( [03-121](http://coursecatalog.web.cmu.edu/search/?P=03-121 \"03-121\") or [03-151](http://coursecatalog.web.cmu.edu/search/?P=03-151 \"03-151\")) and [15-122](http://coursecatalog.web.cmu.edu/search/?P=15-122 \"15-122\")02-712 Comp...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-714",
    "title": "String AlgorithmsFall: 12 units",
    "department": "School of Computer Science",
    "description": "Provides an in-depth look at modern algorithms used to process string data, particularly those relevant to genomics. The course will cover the design and analysis of efficient algorithms for processing enormous collections of strings. Topics will include string search; inexact matching; string compression; string data structures such as suffix trees, suffix arrays, and searchable compressed indices; and the Borrows-Wheeler transform. Applications of these techniques in biology will be presented, including genome assembly, transcript assembly, whole-genome alignment, gene expression quantification, read mapping, and search of large sequence databases. No knowledge of biology is assumed, and the topics covered will be of use in other fields involving large collections of strings. Programming...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-717",
    "title": "Algorithms in NatureFall: 12 units",
    "department": "School of Computer Science",
    "description": "Computer systems and biological processes often rely on networks of interacting entities to reach joint decisions, coordinate and respond to inputs. There are many similarities in the goals and strategies of biological and computational systems which suggest that each can learn from the other. These include the distributed nature of the networks (in biology molecules, cells, or organisms often operate without central control), the ability to successfully handle failures and attacks on a subset of the nodes, modularity and the ability to reuse certain components or sub-networks in multiple applications and the use of stochasticity in biology and randomized algorithms in computer science. In this course we will start by discussing classic biologically motivated algorithms including neural ne...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-718",
    "title": "Computational MedicineFall: 12 units",
    "department": "School of Computer Science",
    "description": "Modern medical research increasingly relies on the analysis of large patient datasets to enhance our understanding of human diseases. This course will focus on the computational problems that arise from studies of human diseases and the translation of research to the bedside to improve human health. The topics to be covered include computational strategies for advancing personalized medicine, pharmacogenomics for predicting individual drug responses, metagenomics for learning the role of the microbiome in human health, mining electronic medical records to identify disease phenotypes, and case studies in complex human diseases such as cancer and asthma. We will discuss how machine learning methodologies such as regression, classification, clustering, semi-supervised learning, probabilistic ...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-720",
    "title": "Computational Biology and SocietyAll Semesters: 3 units",
    "department": "School of Computer Science",
    "description": "The increased effectiveness of algorithms and the increased availability of biomedical data has led to an expanded role of computational biology in medicine and society more broadly. This course will use a variety of sources in the science and media to explore different areas in which computational biology had made an impact on society. The course will consist of series of structured discussions around emerging topics in the field. Specific topics include bias in artificial intelligence, how computational biology is viewed in the media, and the ethics of de- extinction.",
    "units": 3,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-721",
    "title": "Algorithms for Computational Structural BiologyIntermittent: 12 units",
    "department": "School of Computer Science",
    "description": "Some of the most interesting and difficult challenges in computational biology and bioinformatics arise from the determination, manipulation, or exploitation of molecular structures. This course will survey these challenges and present a variety of computational methods for addressing them. Topics will include: molecular dynamics simulations, computer-aided drug design, and computer-aided protein design. The course is appropriate for both students with backgrounds in computer science and those in the life sciences.",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-725",
    "title": "Computational Methods for Proteogenomics and MetabolomicsSpring: 12 units",
    "department": "School of Computer Science",
    "description": "Proteomics and metabolomics are the large scale study of proteins and metabolites, respectively. In contrast to genomes, proteomes and metabolomes vary with time and the specific stress or conditions an organism is under. Applications of proteomics and metabolomics include determination of protein and metabolite functions (including in immunology and neurobiology) and discovery of biomarkers for disease. These applications require advanced computational methods to analyze experimental measurements, create models from them, and integrate with information from diverse sources. This course specifically covers computational mass spectrometry, structural proteomics, proteogenomics, metabolomics, genome mining and metagenomics. Prerequisites: [02-604](http://coursecatalog.web.cmu.edu/search/?P=0...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-735",
    "title": "Ethics in the Practice of Computational BiologyAll Semesters: 3 units",
    "department": "School of Computer Science",
    "description": "Advances in biotechnology and machine learning have rapidly expanded the role that computation plays in basic biology and in medicine. The new ways in which computational biology is applied have created new ethical considerations across the field. This goal of this course is to create awareness of new ethical considerations in computational biology and to provide a forum for the discussion of those issues. The course will consist of series of structured discussions around emerging topics in the field. Specific topics include commercialization of personal genetic data, ethics issues in conservation genomics, and the rise of consortium science.",
    "units": 3,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-740",
    "title": "Bioimage InformaticsIntermittent: 12 units",
    "department": "School of Computer Science",
    "description": "With the rapid advance of bioimaging techniques and fast accumulation of bioimage data, computational bioimage analysis and modeling are playing an increasingly important role in understanding of complex biological systems. The goals of this course are to provide students with the ability to understand a broad set of practical and cutting-edge computational techniques to extract knowledge from bioimages.",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-750",
    "title": "Automation of Scientific ResearchSpring: 12 units",
    "department": "School of Computer Science",
    "description": "Automated scientific instruments are used widely in research and engineering. Robots dramatically increase the reproducibility of scientific experiments, and are often cheaper and faster than humans, but are most often used to execute brute-force sweeps over experimental conditions. The result is that many experiments are \"wasted\" on conditions where the effect could have been predicted. Thus, there is a need for computational techniques capable of selecting the most informative experiments. This course will introduce students to techniques from Artificial Intelligence and Machine Learning for automatically selecting experiments to accelerate the pace of discovery and to reduce the overall cost of research. Real-world applications from Biology, Bioengineering, and Medicine will be studied....",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-761",
    "title": "Laboratory Methods for Automated Biology IFall: 12 units",
    "department": "School of Computer Science",
    "description": "In order to rapidly generate reproducible experimental data, many modern biology labs leverage some form of laboratory automation to execute experiments. In the not so distant future, the use of laboratory automation will continue to increase in the biological lab to the point where many labs will be fully automated. Therefore, it is critical for automation scientists to be familiar with the principles, experimental paradigms, and techniques for automating biological experimentation with an eye toward the fully automated laboratory. In this laboratory course, students will learn about various automatable experimental methods, design of experiments, hardware for preparing samples and executing automated experiments, and software for controlling that hardware. These topics will be taught in ...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-762",
    "title": "Laboratory Methods for Automated Biology IISpring: 12 units",
    "department": "School of Computer Science",
    "description": "This laboratory course provides a continuation and extension of experiences in [02-761](http://coursecatalog.web.cmu.edu/search/?P=02-761 \"02-761\"). Instruction will consist of lectures and laboratory experience using multi-purpose laboratory robotics. During weekly laboratory time, students will complete and integrate parts of two larger projects. The first project will be focused on the execution of a molecular biology experiment requiring nucleic acid extraction, library preparation for sequencing, and quality control. The second project will be focused on the implementation and execution of automated methods using active learning techniques to direct the learning of a predictive model for a large experimental space (such as learning the effects of many possible drugs on many possible t...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "02-798",
    "title": "Integrated MS Industry CapstoneAll Semesters: 12 units",
    "department": "School of Computer Science",
    "description": "Integrated MS Industry Capstone",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "15-050",
    "title": "Study AbroadAll Semesters",
    "department": "School of Computer Science",
    "description": "Students who are interested in studying abroad should first contact the Office of International Education. More information on Study Abroad is available on OIE's Study Abroad page and at the CS Undergraduate Office.",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "15-090",
    "title": "Computer Science PracticumAll Semesters: 3 units",
    "department": "School of Computer Science",
    "description": "This course is for Computer Science students who wish to have an internship experience as part of their curriculum. Students are required to write a one-page summary statement prior to registration that explains how their internship connects with their CS curriculum, specifically on how it uses material they have learned as well as prepares them for future courses. Near the end of the internship, students will be required to submit a reflection paper that describes the work they did in more detail, including lessons learned about the work experience and how they utilized their CS education to work effectively. International students should consult with the Office of International Education for appropriate paperwork and additional requirements before registration. Units earned count toward ...",
    "units": 3,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "15-104",
    "title": "Introduction to Computing for Creative PracticeFall: 10 units",
    "department": "School of Computer Science",
    "description": "An introduction to fundamental computing principles and programming techniques for creative cultural practices, with special consideration to applications in music, design and the visual arts. Intended for students with little to no prior programming experience, the course develops skills and understanding of text-based programming in a procedural style, including idioms of sequencing, selection, iteration, and recursion. Topics include data organization (arrays, files, trees), interfaces and abstraction (modular software design, using sensor data and software libraries), basic algorithms (searching and sorting), and computational principles (randomness, concurrency, complexity). Intended for students participating in IDeATe courses or minors who have not taken [15-112](http://coursecatalo...",
    "units": 10,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "15-195",
    "title": "Competition Programming IAll Semesters: 5 units",
    "department": "School of Computer Science",
    "description": "Each year, Carnegie Mellon fields several teams for participation in the ICPC Regional Programming Contest. During many recent years, one of those teams has earned the right to represent Carnegie Mellon at the ICPC World Finals. This course is a vehicle for those who consistently and rigorously train in preparation for the contests to earn course credit for their effort and achievement. Preparation involves the study of algorithms, the practice of programming and debugging, the development of test sets, and the growth of team, communication, and problem solving skills. Neither the course grade nor the number of units earned are dependent on ranking in any contest. Students are not required to earn course credit to participate in practices or to compete in ACM-ICPC events. Students who have...",
    "units": 5,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "15-210",
    "title": "Parallel and Sequential Data Structures and AlgorithmsFall and",
    "department": "School of Computer Science",
    "description": "Teaches students about how to design, analyze, and program algorithms and data structures. The course emphasizes parallel algorithms and analysis, and how sequential algorithms can be considered a special case. The course goes into more theoretical content on algorithm analysis than [15-122](http://coursecatalog.web.cmu.edu/search/?P=15-122 \"15-122\") and [15-150](http://coursecatalog.web.cmu.edu/search/?P=15-150 \"15-150\") while still including a significant programming component and covering a variety of practical applications such as problems in data analysis, graphics, text processing, and the computational sciences. NOTE: students must achieve a C or better in order to use this course to satisfy the pre-requisite for any subsequent Computer Science course. Register for Lecture 1. All st...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "15-288",
    "title": "Special Topic: Machine Learning in a NutshellFall and",
    "department": "School of Computer Science",
    "description": "THIS COURSE RUNS IN CMU QATAR ONLY. This course is about the application of machine learning (ML) concepts and models to solve challenging real-world problems. The emphasis of the course is on the methodological and practical aspects of designing, implementing, and using ML solutions. Course topics develop around the notion of ML process pipeline, that identifies the multi-staged process of building and deploying an ML solution. An ML pipeline includes: de nition of the problem, objectives, and performance metrics; collection and management of relevant operational data; data wrangling (transforming, cleaning, ltering, scaling); perform feature engineering on the available data in terms of feature selection, feature extraction, feature processing; selection of appropriate ML models based on...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "15-292",
    "title": "History of ComputingSpring: 5 units",
    "department": "School of Computer Science",
    "description": "This course traces the history of computational devices, pioneers and principles from the early ages through the present. Topics include early computational devices, mechanical computation in the 19th century, events that led to electronic computing advances in the 20th century, the advent of personal computing and the Internet, and the social, legal and ethical impact of modern computational artifacts. This course also includes a history of programming languages, operating systems, processors and computing platforms. Students should have an introductory exposure to programming prior to taking this course. Prerequisites: ( [76-102](http://coursecatalog.web.cmu.edu/search/?P=76-102 \"76-102\") or [76-108](http://coursecatalog.web.cmu.edu/search/?P=76-108 \"76-108\") or [76-107](http://coursecat...",
    "units": 5,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "15-294",
    "title": "Special Topic: Rapid Prototyping TechnologiesFall and",
    "department": "School of Computer Science",
    "description": "This mini-course introduces students to rapid prototyping technologies with a focus on laser cutting and 3D printing. The course has three components: 1) A survey of rapid prototyping and additive manufacturing technologies, the maker and open source movements, and societal impacts of these technologies; 2) An introduction to the computer science behind these technologies: CAD tools, file formats, slicing algorithms; 3) Hands-on experience with SolidWorks, laser cutting, and 3D printing, culminating in student projects (e.g. artistic creations, functional objects, replicas of famous calculating machines, etc.). Prerequisites: [15-110](http://coursecatalog.web.cmu.edu/search/?P=15-110 \"15-110\") Min. grade C or [15-104](http://coursecatalog.web.cmu.edu/search/?P=15-104 \"15-104\") Min. grade C...",
    "units": 5,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "15-312",
    "title": "Foundations of Programming LanguagesFall and",
    "department": "School of Computer Science",
    "description": "This course discusses in depth many of the concepts underlying the design, definition, implementation, and use of modern programming languages. Formal approaches to defining the syntax and semantics are used to describe the fundamental concepts underlying programming languages. A variety of programming paradigms are covered such as imperative, functional, logic, and concurrent programming. In addition to the formal studies, experience with programming in the languages is used to illustrate how different design goals can lead to radically different languages and models of computation. Prerequisites: [15-150](http://coursecatalog.web.cmu.edu/search/?P=15-150 \"15-150\") Min. grade C and ( [15-251](http://coursecatalog.web.cmu.edu/search/?P=15-251 \"15-251\") Min. grade C or [21-228](http://cours...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "15-316",
    "title": "Software Foundations of Security and PrivacyFall: 9 units",
    "department": "School of Computer Science",
    "description": "Security and privacy issues in computer systems continue to be a pervasive issue in technology and society. Understanding the security and privacy needs of software, and being able to rigorously demonstrate that those needs are met, is key to eliminating vulnerabilities that cause these issues. Students who take this course will learn the principles needed to make these assurances about software, and some of the key strategies used to make sure that they are correctly implemented in practice. Topics include: policy models and mechanisms for confidentiality, integrity, and availability, language-based techniques for detecting and preventing security threats, mechanisms for enforcing privacy guarantees, and the interaction between software and underlying systems that can give rise to practic...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "15-327",
    "title": "Monte Carlo Methods and ApplicationsFall: 9 units",
    "department": "School of Computer Science",
    "description": "The Monte Carlo method uses random sampling to solve computational problems that would otherwise be intractable, and enables computers to model complex systems in nature that are otherwise too difficult to simulate. This course provides a first introduction to Monte Carlo methods from complementary theoretical and applied points of view, and will include implementation of practical algorithms. Topics include random number generation, sampling, Markov chains, Monte Carlo integration, stochastic processes, and applications in computational science. Students need a basic background in probability, multivariable calculus, and some coding experience in any language. Prerequisites: ( [21-269](http://coursecatalog.web.cmu.edu/search/?P=21-269 \"21-269\") Min. grade C or [21-256](http://coursecatalo...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "15-348",
    "title": "Embedded SystemsSpring: 9 units",
    "department": "School of Computer Science",
    "description": "This course is offered only at Carnegie Mellon's campus in Qatar. This course covers the broad range of foundational skills that apply across all embedded computer system application areas, from thermostats to self-driving vehicles. The emphasis is at the layer where hardware meets software. Topics include microcontroller hardware, assembly language, embedded C programming, analog I/O, timers, code optimization, interrupts, and concurrency. Real world engineering practices, constraints, and example applications are integrated throughout the course. Weekly hands-on hardware and software experiences with an industry-strength automotive embedded controller are coordinated with the lecture content to reinforce core skills. Prerequisite: [15-122](http://coursecatalog.web.cmu.edu/search/?P=15-12...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "15-351",
    "title": "Algorithms and Advanced Data StructuresFall and",
    "department": "School of Computer Science",
    "description": "The objective of this course is to study algorithms for general computational problems, with a focus on the principles used to design those algorithms. Efficient data structures will be discussed to support these algorithmic concepts. Topics include: Run time analysis, divide-and-conquer algorithms, dynamic programming algorithms, network flow algorithms, linear and integer programming, large-scale search algorithms and heuristics, efficient data storage and query, and NP-completeness. Although this course may have a few programming assignments, it is primarily not a programming course. Instead, it will focus on the design and analysis of algorithms for general classes of problems. This course is not open to CS graduate students who should consider taking 15-651 instead. THIS COURSE IS NOT...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "15-362",
    "title": "Computer GraphicsFall and",
    "department": "School of Computer Science",
    "description": "This course provides a comprehensive introduction to computer graphics modeling, animation, and rendering. Topics covered include basic image processing, geometric transformations, geometric modeling of curves and surfaces, animation, 3-D viewing, visibility algorithms, shading, and ray tracing. Prerequisites: ( [15-122](http://coursecatalog.web.cmu.edu/search/?P=15-122 \"15-122\") Min. grade C and [21-122](http://coursecatalog.web.cmu.edu/search/?P=21-122 \"21-122\") Min. grade C and [21-240](http://coursecatalog.web.cmu.edu/search/?P=21-240 \"21-240\") Min. grade C) or ( [21-122](http://coursecatalog.web.cmu.edu/search/?P=21-122 \"21-122\") Min. grade C and [21-241](http://coursecatalog.web.cmu.edu/search/?P=21-241 \"21-241\") Min. grade C and [15-122](http://coursecatalog.web.cmu.edu/search/?P=15...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "15-367",
    "title": "Algorithmic Textiles DesignIntermittent: 12 units",
    "department": "School of Computer Science",
    "description": "Textile artifacts are and #8212; quite literally and #8212; all around us; from clothing to carpets to car seats. These items are often produced by sophisticated, computer-controlled fabrication machinery. In this course we will discuss everywhere code touches textiles fabrication, including design tools, simulators, and machine control languages. Students will work on a series of multi-week, open-ended projects, where they use code to create patterns for modern sewing/embroidery, weaving, and knitting machines; and then fabricate these patterns in the textiles lab. Students in the 800-level version of the course will additionally be required to create a final project that develops a new algorithm, device, or technique in textiles fabrication. Course Website: [http://graphics.cs.cmu.edu/co...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "15-382",
    "title": "Coll",
    "department": "School of Computer Science",
    "description": "",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "94-216",
    "title": "Introduction to Decision Analytics and SystemsIntermittent: 6 units",
    "department": "Heinz College",
    "description": "This course introduces students to the analytics toolkit (data systems, Operations Research, Machine Learning, Statistics. and causal inference) and what it takes to use formulate problems, scope them and understand how to intervene to support decision making to achieve policy objectives. In short, it introduces you to the art and science of translating analytics into action using \"curated examples\" and case studies from the real world. These case studies will introduce you to key elements of the data-driven and model-based approaches to decision-making. The approaches you will be exposed to in this course find wide application. Examples include the creation of transportation systems (bus, on-demand rideshare, bike share) to equitably serve all neighborhoods, the responsible use of AI in s...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "94-217",
    "title": "Systems Thinking and Discrete Event SimulationIntermittent: 6 units",
    "department": "Heinz College",
    "description": "We are surrounded by complex systems with interrelated components. In this course, we will introduce two components of system analysis and modeling: Systems Thinking and Discrete Event Simulation. In the first part of the course, Systems Thinking, you will learn how to approach complex systems, identify their components, and understand the interactions and their impact on the system. In the second part of the class, you will learn practical skills by using Discrete Event Simulation to model and analyze real-world systems. At the end of the course, you will be able to understand and approach problems from a systems perspective and propose effective policies to improve the performance of the system. The course will be divided into two main units: Systems Thinking and Discrete Event Simulatio...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "94-401",
    "title": "Acting for Leadership and CommunicationFall and",
    "department": "Heinz College",
    "description": "Actors use \"tools\" (voice, body, focus, intention) to convey emotion and connect authentically audiences. Acting for Management will help you utilize the actor's tools to become a more powerful and persuasive presenter, to feel more confident when communicating with others, to understand yourself and your audience and to show the world the best and most authentic version of you. Through in-class exercises, scene work and discussion, you will practice the craft of acting and learn how it can enhance your abilities as a person, manager and leader.",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "94-402",
    "title": "Geographic Information SystemsFall and",
    "department": "Heinz College",
    "description": "A geographic information system (GIS) provides storage, retrieval, and visualization of geographically referenced data as well as design and analysis of spatial information. GIS provides unique analytical tools to investigate spatial relationships, patterns, and processes of cultural, biological, demographic, economic, social, environmental, health care, criminal, and other phenomena. The course includes lectures, computer labs, and a project using the leading desktop GIS software, ArcGIS Pro, from Esri, Inc. Subject areas will include: - Geographic concepts (world coordinate systems, map scale/projections, sea level/elevation), - Government-provided map infrastructure (TIGER maps, census data, satellite and aerial photo images, local government cadastral maps), - Map design (cartography, ...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "94-403",
    "title": "Consulting LabIntermittent: 6 units",
    "department": "Heinz College",
    "description": "Communication is the glue that holds consulting engagements, teams, and relationships together. Arguably, the better a consultant you are, the better a communicator you are, and the best communicators tend to make very good consultants (nice symmetry there). Poor communication and other 'soft skills' can derail a consulting engagement and with it, a promising consulting career. As an example, a Gartner Group study found that 80% of all IT projects were late, over budget, or failed completely because of poor communication at the outset. This course will help students interested in a consulting career acquire new skills in everything from personal branding to asking high-value, incisive questions to building strong, long-term client relationships",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "94-408",
    "title": "Management ConsultingIntermittent: 12 units",
    "department": "Heinz College",
    "description": "This is an applications course exploring the profession of management consulting and the art and science of providing management counsel to organizations in the public and private sectors. The course is designed to provide a framework for collaborating with organizations to solve problems and to execute projects efficiently and effectively. Students will explore and utilize practical tools that will enable them to solve problems and execute projects as external or internal consultants or as individual contributors or leaders within organizations. The course introduces frameworks as well as quantitative and qualitative methods that are typically used in management consulting. Course Website: [https://api.heinz.cmu.edu/courses\\_api/course\\_list/](https://api.heinz.cmu.edu/courses_api/course_...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "94-411",
    "title": "Strategy DevelopmentIntermittent: 6 units",
    "department": "Heinz College",
    "description": "This course introduces students to frameworks for understanding strategy development and implementation. Through a combination of theory and practice, students will be exposed to processes for formulating a sound, rational business strategy as well as the discipline required to successfully implement that strategy. Course activities and concepts include: 1) situational and environmental analysis, 2) internal capabilities assessment, and 3) appropriate linkage to an organizations vision, mission, objectives, and historical performance. In addition, although these processes are most often attributed to private sector operations, this course is designed to consider the similarities and differences of strategy development in government entities and nonprofits as well. There are no prerequisite...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "94-413",
    "title": "Project ManagementFall and",
    "department": "Heinz College",
    "description": "As organizations continue to look for ways to reduce costs, managers are often expected to oversee special projects in addition to their traditional responsibilities. When a project is too complex for one person to handle, the project manager is expected to lead a team of diverse employees to complete the assignment. This course will assist the project manager to break down a complex project into manageable segments, lead a diverse project team, and use effective tools to ensure that the project meets its deliverables and is completed within budget and on schedule. Over the course of the mini, students will complete a plan for an actual project, giving them valuable experience with the relevant tools and skills, including Microsoft Project software.",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "94-416",
    "title": "Introduction to Decision Analytics and SystemsIntermittent: 6 units",
    "department": "Heinz College",
    "description": "This course introduces students to the analytics toolkit (data systems, Operations Research, Machine Learning, Statistics. and causal inference) and what it takes to use formulate problems, scope them and understand how to intervene to support decision making to achieve policy objectives. In short, it introduces you to the art and science of translating analytics into action using \"curated examples\" and case studies from the real world. These case studies will introduce you to key elements of the data-driven and model-based approaches to decision-making. The approaches you will be exposed to in this course find wide application. Examples include the creation of transportation systems (bus, on-demand rideshare, bike share) to equitably serve all neighborhoods, the responsible use of AI in s...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "94-423",
    "title": "Measuring SocialFall and",
    "department": "Heinz College",
    "description": "Measuring Social is an experiential learning class for graduate students across Carnegie Mellon. We bring in 5-7 corporate sponsors each semester (Spring and amp; Fall) and amp; they develop a project for the student teams to work on over the semester. Each project involves an element of measuring unstructured social data as well as providing recommendations based on its analysis. The class has been running since 2010 and amp; we have done over 120 projects in the class for close to 100 different unique clients including Marriot, Google, Warner Bros., Sony PlayStation, Nike, Target, Ford, NYTimes, The Lincoln Center, American Express, The Gap, NBCUniversal, Microsoft, etc. We welcome graduate students from across CMU including Data Analytics, Public Policy, Entertainment and amp; Arts Mana...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "94-426",
    "title": "Combatting Hate, Extremism, and PolarizationIntermittent: 12 units",
    "department": "Heinz College",
    "description": "This course is a small group praticum course that will allow a small group to work closely with the advisor, Former Mayor Bill Peduto, on a project with the Strong Cities Network to continue previous student work and to provide quantitative and qualitative research and analysis for the participating cities. Students will utilize hate crime data, economic and societal demographic data as well as best practice models of local policies and programs to assist SCN and the National League of Cities in developing plans for each unique city. Students will have the opportunity to participate in on-line training with the leaders of each city and receive independent instruction by the Bill Peduto, local and national experts and SCN staff. The Strong Cities Network is an independent global organizatio...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "94-431",
    "title": "Applied Econometrics for DASIntermittent: 6 units",
    "department": "Heinz College",
    "description": "Econometrics has an important place in the data sciences. As your textbook authors say, the purpose of econometrics is to \"untangle cause and effect in human affairs.\" Econometrics is essential for advancing understanding in the social sciences, conducting public policy evaluation, and assessing the impact of business practice. Both Applied Econometrics I and Applied Econometrics II are \"hands on\" courses in which you will not only learn to read and interpret existing studies, but will also conduct econometric analyses of your own. The goal is to help you take your first few steps toward becoming a \"Metrics Master\"! One of those steps is becoming competent and confident in the use of Stata to conduct empirical analyses. Pre-requisites: Applied Econometrics I: Students are presumed to have ...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "94-432",
    "title": "Business Intelligence & Data Mining SASFall and",
    "department": "Heinz College",
    "description": "With the proliferation of Web 2.0 making inroads into the enterprises and industries, the ability to understand, analyze and interpret businesses from Big Data has become increasingly more important today. This class aims to equip you with highly demanded business analytics skills in the current job market. The course will focus on extracting business intelligence by leveraging firm's business data as well as online social media content for various applications, including (but not limited to) search engine marketing, social media analytics, crowd-sourcing management, market analysis and demand estimation, social network analysis, customer segmentation, customer relationship management (CRM), web mining and health care management. The class will be hands-on and the emphasis will be placed o...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "94-433",
    "title": "Optimization for DASIntermittent: 6 units",
    "department": "Heinz College",
    "description": "This course provides an introduction to modeling and computational methods used by policy-makers, managers and analysts to support decision-making. The first half of the course focuses on deterministic optimization, and covers linear programming, network optimization and integer programming. The second half of this course introduces risk and uncertainty, and includes methods to characterize uncertainty and methods to optimize decisions under uncertainty. Examples are drawn from a variety of domains where these decision-making methods can provide value for business and policy, such as transportation, energy, health care, manufacturing, supply chain management, etc. The readings, lectures, homework assignments and exams will help you develop modeling skills, computational skills, and analyti...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "94-440",
    "title": "Datapreneurship - Innovating on AnalyticsIntermittent: 6 units",
    "department": "Heinz College",
    "description": "This course is designed to introduce you to the many elements of entrepreneurship, with a specific focus on digital and data innovation. Data and the insights gained from it are increasingly becoming more valuable as a product than past traditional business models. From start-ups to the creation of new business opportunities within larger enterprises, we will explore what are the necessary elements for success and what are some of the challenges faced in this rapidly emerging field. The course will rely heavily on in-class participation, including small team projects and presentations, lectures and readings. We will pair the theoretical framework of entrepreneurial issues with guest speakers who are current data entrepreneurs and investors so you can see the frameworks in action and ask qu...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "94-441",
    "title": "Ethics and Politics of DataIntermittent: 6 units",
    "department": "Heinz College",
    "description": "The objective of this course is to introduce students to the many ethical and political issues arising in the gathering, storage, processing, and exploitation of data. The course will instruct students on how to contribute to ethical debates about data and to help make policy about it. Students will learn how to write effective and readable opinion pieces publishable on intellectually respectable Internet news sites and offered to potential employers as demonstration of your ability to write in an informed, persuasive, and engaging way about some of the headline ethical issues of the day. This is an interdisciplinary course. It draws on information from many different sources, including economics, politics, ethics, philosophy, and data science. The interdisciplinary focus of the course mea...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "94-443",
    "title": "Research Studio: Arts FuturesFall and",
    "department": "Heinz College",
    "description": "Coming soon",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "94-454",
    "title": "Developing as a LeaderFall and",
    "department": "Heinz College",
    "description": "This course introduces students to leadership via three learning frameworks: models, practice and reflection. Using guest lectures, readings and videos, and small group discussions, we will define leadership and provide applicable frameworks for leadership practice. Students will be able to experiment and practice different skills and styles in a safe environment where they can receive useful feedback. To help students pursue their own personal path of leadership development, the focus is on formulating personal goals, models and activities that sustain this development over the course of their careers.",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "94-470",
    "title": "Telling Stories with DataIntermittent: 6 units",
    "department": "Heinz College",
    "description": "Data visualization is the art of understanding how humans understand our visual environment and of applying that knowledge to the visual representation of information. The ability to effectively tell a story through data can be the difference for an initiative being successful, research being remembered, or a story that leads to action. Part art, part science, visualizing data is a process that is both well established in some disciplines while also rapidly changing and evolving in others. Students will learn to critique and create data visualizations using different methods. Students will explore various aspects to visualization as we deconstruct and reconstruct visualizations, learning how others use different approaches to communicate effectively. We'll dig into data in different ways t...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "94-475",
    "title": "Practical Unstructured Data AnalyticsIntermittent: 6 units",
    "department": "Heinz College",
    "description": "Companies, governments, and other organizations now collect massive amounts of data such as text, images, audio, and video. How do we turn this heterogeneous mess of data into actionable insights? A common problem is that we often do not know what structure underlies the data ahead of time, hence the data often being referred to as \"unstructured\". This course takes a practical approach to unstructured data analysis via a two-step approach: We first examine how to identify possible structure present in the data via visualization and other exploratory methods. Once we have clues for what structure is present in the data, we turn toward exploiting this structure to make predictions. Many examples are given for how these methods help solve real problems faced by organizations. There is a final...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "94-483",
    "title": "Applied Ethical AnalysisIntermittent: 6 units",
    "department": "Heinz College",
    "description": "This course provides a framework to increase accountability through ethical decision-making. The goal of this course is to allow you to understand the complexity and consequences of decisions, the utility of ethics in personal and professional life, and the motivations of others (be they ethical or not). You will gain the ability to recognize and address underlying principles in a variety of contextual dilemmas. Students will learn to practically apply established theory and methodology to create and sustain trustworthiness. Case studies, small group discussions, scholarly readings, and videos will demonstrate the relevance and importance of applied ethics.",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "94-485",
    "title": "Societal Consequences of Technological Change: Precision MedicineIntermittent: 3 units",
    "department": "Heinz College",
    "description": "According to the National Institutes of Health, precision medicine is \"an emerging approach for disease treatment and prevention that takes into account individual variability in genes, environment, and lifestyle for each person.\" This approach allows doctors and researchers to predict more accurately which treatment and prevention strategies for a particular disease will work in which groups of people. It is in contrast to a one-size-fits-all approach, in which disease treatment and prevention strategies are developed for the average person, with less consideration for the differences between individuals. Advances in precision medicine have already led to powerful new discoveries and several new treatments that are tailored to specific characteristics, such as a person's genetic makeup. W...",
    "units": 3,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "94-486",
    "title": "Advances in Robotic Process AutomationIntermittent: 6 units",
    "department": "Heinz College",
    "description": "Today's new generation of sophisticated workforce robots act across business functions, integrate cloud and legacy applications, and are self-managing, scalable and fully dynamic. This course is an introduction into the fundamentals of Robotic Process Automation (RPA) and how it is transforming the world by combining software robotics with the power of artificial intelligence (AI) and machine learning (ML). During the class we will dig into the technology, understand how advanced RPA delivers business value, identify processes ripe for this automation, and build an RPA business case. We will also discuss the talent implications of bringing \"bots to work\" and the impact on the organization and its workforce. Throughout the course we will be joined by business leaders who will share their ex...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "94-489",
    "title": "Machine Learning for Public Policy LabIntermittent: 12 units",
    "department": "Heinz College",
    "description": "This is a project-based course designed to provide students training and experience in solving real-world problems using machine learning, with a focus on problems from public policy and social good. Through lectures, discussions, readings, and project assignments, students will learn about and experience building end-to-end machine learning systems, starting from project definition and scoping, through modeling, to field validation and turning their analysis into action. Through the course, students will develop skills in problem formulation, working with messy data, communicating about machine learning with non-technical stakeholders, model interpretability, understanding and mitigating algorithmic bias and amp; disparities, and evaluating the impact of deployed models. Students will be ...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "94-490",
    "title": "Race, Politics and Policies in the USIntermittent: 6 units",
    "department": "Heinz College",
    "description": "Race, Politics and Policies will address the politics of segregation and discrimination that have been present in the U.S since its independence. In this course, we will discuss the political foundations of racial segregation and the many policies that have consolidated discrimination and disparities. Because this is essentially a policy course, we are going to analyze disparities and discrimination in a variety of policy areas including education, health, housing, access to social services and employment. The course will not only analyze existing policies, but also attempt to provide solutions to these problems, including current proposals such as reparations. Pittsburgh will be used as one of several case studies of local disparities. Basic requirements are writing two policy memos and d...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "94-491",
    "title": "Lean Innovation LabIntermittent: 12 units",
    "department": "Heinz College",
    "description": "[94-491](http://coursecatalog.web.cmu.edu/search/?P=94-491 \"94-491\") Lean Innovation Lab is a specialized Heinz College supercourse that is designed to challengestudents to tackle new and emerging problemsthrough mission-driven entrepreneurship. Students will select from a set of carefully curated, complex, and amp; real-worldproblem sets while learning about the problem sponsorsas an organization, their culture, and their mission to instill a culture of relentless resilience and new innovative practices. Individuals will learn to apply Lean Innovation frameworks and tools to identify key stakeholders, understand their needs, and develop and test iterative minimum viable products (MVPs) thatleadto an applicable solution. Using a flipped-classroom approach, the students brief the teac...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "95-401",
    "title": "IdeaLabIntermittent: 3 units",
    "department": "Heinz College",
    "description": "We all have ideas; ideas are rarely the problem. The problem whether you have an entrepreneurial idea, a policy idea, a process idea, a product idea, even an academic idea isnt how to have the idea, but how to advance the idea. And for this, design thinking and creative thinking tools and techniques can help. IdeaLab is a micro-course and laboratory that helps students learn the tools and techniques that will help them advance their ideas whatever they are to a point where they are taken seriously by managers, funders, and any other important audience.",
    "units": 3,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "95-408",
    "title": "IT Project ManagementIntermittent: 6 units",
    "department": "Heinz College",
    "description": "From the smallest to the largest organization, the electronic storage and flow of information is critical to the successful achievement of goals, objectives and the provision of products and services. To manage that delivery process, we now find the construct mechanism for the delivery of those products and services to be the \"Project\" rather than a series of non-integrated tasks. The increased dependence upon projects necessitates the need for both improved project management and oversight. The purpose of this course is to assist professionals in understanding the components of complex projects, manage those project components, and to form and lead a project team. Project Management tools and techniques will be introduced, discussed, and applied.",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "95-410",
    "title": "Blockchain FundamentalsIntermittent: 6 units",
    "department": "Heinz College",
    "description": "This class will be a deep-dive into blockchain technology. We will discuss the fundamental cryptographic under-pinnings of the technology as well as different consensus mechanisms currently available. We'll discuss both single-purpose blockchains such as Bitcoin as well as general-purpose implementations. We'll discuss govern-ance of blockchain technology and related challenges, as well as legal challenges and concerns. This course will also provide an overview of blockchain programming, highlighting both existing challenges and specific nu-ances in blockchain programming. Students should leave the class with a better understanding of what block-chain technology is, what types of problems are best suited for blockchain-based solutions, as well as a more thorough understanding of the impact...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "95-411",
    "title": "Blockchain TechnologiesIntermittent: 3 units",
    "department": "Heinz College",
    "description": "This is a hands-on course covering blockchain technologies. We will discuss cryptography, BitCoin, Ethereum, decentralized peer to peer systems, Merkle Trees, distributed hash tables, smart contracts, distributed consensus, Solidity, ERC-20 Tokens, distributed ledger use cases and CMU Coin, and self-sovereign identity. The course includes hands on lab exercises building smart contracts.",
    "units": 3,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "95-421",
    "title": "Product Management in ITFall and",
    "department": "Heinz College",
    "description": "Product Management in IT (95-821) is an introductory mini-course (6 Units) for MISM and MSIT students who are interested in exploring product management for IT-based products and services that are sold to customers, as well as IT apps and services that are developed for coworkers and partners. Through interactive lecture, case discussions, and assignments, students will learn about product management concepts. They will learn and use frameworks and tools to address strategy challenges and tactical issues across the product lifecycle. Further, the course will build on students' knowledge of marketing, engineering, accounting, and manufacturing, showing how product managers work cross-functionally. And, students will learn how product management compares in industries served, organization st...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "95-422",
    "title": "Managing Digital TransformationIntermittent: 9 units",
    "department": "Heinz College",
    "description": "The goal of this course is to analyze and understand how technological change impacts firms, markets, supply chains, and regulatory/policy structures. Information and communication technologies play multiple roles within businesses, organizations, industries, and societies: From a technological perspective, they define the information and communication infrastructure of the entity and they enable new ways to digitize processes. From a managerial perspective, they facilitate new coordination and communication processes within and across entities, enable new organizational forms, change the information environment underlying the business, and permit new incentive and monitoring structures. From a policy perspective, these new coordination and communication processes, new organizational forms...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "95-433",
    "title": "Internet of ThingsIntermittent: 6 units",
    "department": "Heinz College",
    "description": "Prerequisites: The ability to program is a prerequisite. Course Description: Traditional products are becoming smart products and smart products are becoming connected. From smart homes to smart cities, this trend is likely to have a profound impact on our future. This course takes the view that the internet of things is best viewed as an extension of the World Wide Web. So, we will spend some time studying how the Web was designed and how its principles can be used to design the internet of things. This course combines weekly readings from journal articles with hands-on exercises and programming. The student will work with modern IOT technologies, standards, and platforms. We will connect sensors and actuators to the cloud but will do so in a way that is based on sound architectural princ...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "95-443",
    "title": "Cybersecurity Policy and Governance IIntermittent: 6 units",
    "department": "Heinz College",
    "description": "Across the board, IT managers in government and industry are concerned with regulatory compliance. This course is designed to introduce students to key Information Security industry and government policies, regulations and standards. The course is structured to familiarize students with base standards, like NIST, and more specific regulatory requirements, and to help students understand how those requirements are met, using frameworks, controls and training. The goal of this course is provide students with an understanding of how to develop an organization's information security policy and procedures to comply with government and industry regulations. This course is for graduate students seeking to work or manage an information security and privacy department.",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "95-444",
    "title": "Cybersecurity Policy and Governance IIIntermittent: 6 units",
    "department": "Heinz College",
    "description": "The ability to secure information within a modern enterprise is a growing challenge. Threats to information security are global, persistent, and increasingly sophisticated. Long gone are the days when managers could hope to secure the enterprise through ad hoc means. Effective information security at the enterprise level requires participation, planning, and practice. Fortunately, the information security community has developed a variety of resources, methods, and best practices to help modern enterprises address the challenge. However, employing these tools demands a high degree of commitment, understanding, and skillattributes that must be sustained through constant awareness and training. An essential part of the information security plan is cyber security policy this includes the writ...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "95-451",
    "title": "Making Products Count: Data Science for Product ManagersIntermittent: 6 units",
    "department": "Heinz College",
    "description": "Product managers engage in a variety of complex activities critical to product success including Gathering product requirements Prioritizing features Forecasting customer demand Customer segmentation Pricing Identifying buying patterns Analyzing and responding to customer feedback Historically decisions in these areas have often relied on intuition and guesswork, leading to misjudgment of the market and other key factors, and ultimately, product failures. Developments in data science, combining the increasing availability of data from internal and external sources with new algorithms that exploit that data at scale, offer new possibilities for putting product management decisions on a more quantitative and rigorous footing. Students in this course will be introduced to a variety of data sc...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "95-452",
    "title": "Introduction to Information Security ManagementIntermittent: 12 units",
    "department": "Heinz College",
    "description": "This course is intended to give students an introduction to a variety of information and cyber security topics. As a survey course, it will cover foundational technical concepts as well as managerial and policy topics. Coverage includes foundations of information security; introductory cryptography; program, data, and operating system security; security of user-web interaction; safeguarding the Internet of Things; cyberwarfare; securing virtual, cloud, and mobile environments; network concepts and network security; incident management and IT auditing processes; security risk management; legal and ethical issues of security and privacy. Students are exposed to common sources of vulnerability information and how to incorporate this information into information security management processes. ...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "95-455",
    "title": "Information Security Risk ManagementIntermittent: 6 units",
    "department": "Heinz College",
    "description": "This is an undergraduate course. Graduate students looking to take this course should register for 95-755. This course examines risk management and its application to information security. The course will help the student identify information security risks, evaluate those risks, and make risk-based decisions given organizational resource constraints. Students will learn foundational concepts in risk management and will be introduced to risk management standards and approaches, both qualitative and quantitative, for risk analysis.",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "95-466",
    "title": "Advanced Business AnalyticsIntermittent: 6 units",
    "department": "Heinz College",
    "description": "Growth in Web 2.0 coincides with the growth in firms ability to collect large customer data. Firms know micro level data about customer transactions and have an ability to correlate such data with other datasets. In this course, we will learn powerful but simple probability/statistical models that can be applied to fit these data to generate useful predictions. The course will go beyond pattern detections, clustering, or correlation in data to build models of plausible consumer behavior that generates the data. Thus the goal is to build a model of consumer behavior and apply this model to data to test how accurate this model is and tweak it if necessary. Most importantly, with such a model in hand, we want to predict how outcomes will change if the firm changed its strategy. Thus a key goa...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "95-475",
    "title": "IT Business LeadershipIntermittent: 6 units",
    "department": "Heinz College",
    "description": "Can leadership be taught within the classroom? Can one lead without speaking? What are the differences, if any, between leadership and management? These questions and others are addressed using an eclectic mix of in-class exercises, guest lecturer presentations, and personal story-sharing. We will examine the concepts of initiative, integrity, power, control, and authority. In today's business world, the ability to work within - and lead - groups of all sizes becomes a prime requisite for success at the managerial and executive level. Business and technical acumen is the entry fee to professional success; the ability to lead is distinguishing. This is an open discussion course wherein students are required to share their own stories as they listen to those of their peers. Numerous studies ...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "95-481",
    "title": "Web Application DevelopmentIntermittent: 6 units",
    "department": "Heinz College",
    "description": "This is an undergraduate course. Graduate students looking to take this course should register for 95-881. Heinz web courses are a mix of business, technology and analytics. The focus of this web course will be on the development of content-based web products with a focus on front-end programming. Programming in HTML and JavaScript will combine traditional software development combined with cutting-edge Generative AI tools. AI-assisted development platforms will be overviewed to help generate code, debug errors, and experiment with advanced techniques. Web applications should leverage analytics-based insights to adapt to their users. Approaches that we will cover includes the instrumentation of a web page to capture user behavior. We will analyze data indicators as an approach to ch...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "95-482",
    "title": "Enterprise Web DevelopmentIntermittent: 6 units",
    "department": "Heinz College",
    "description": "This course is intended for undergraduate students who are in their third year or later. Graduate students should enroll in 95-882. Heinz web courses are a mix of business, technology and analytics.Enterprise web applications are a complex relationship between the client, server, and any additional back-end services. Web systems are becoming more supportive of users such that the system must adapt based on the needs and behaviors of the users. This course will support the understanding of the data that drives the enterprise web development, which includes the analysis of web traffic and usage, ads, and the personalization of the web experience.To accomplish all this, AI will be used to streamline your coding process, inspire creativity, and accelerate problem-solving. This course focu...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "95-483",
    "title": "Ethical Penetration TestingIntermittent: 6 units",
    "department": "Heinz College",
    "description": "This course will introduce students to professional penetration testing by teaching offensive tactics along with the appropriate methodologies and responsibilities it takes to ethically attack systems. The majority of time will be spent in hands-on labs performing reconnaissance, discovering vulnerabilities, developing exploits, and carefully penetrating targets.",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "95-499",
    "title": "Linux and Open SourceFall and",
    "department": "Heinz College",
    "description": "This course covers the Linux operating system, its related applications, and the Open Source Software (OSS) model. Emphasis is on how Linux is different from other systems. Note example syllabus may be from online or on-campus Mini. Topics and general structure are the same, quiz and participation grading vary between online or on-campus.",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "95-702",
    "title": "Distributed Systems for Information Systems ManagementAll Semesters: 12 units",
    "department": "Heinz College",
    "description": "With the emergence of the Internet as a computing platform, distributed applications are being widely deployed by organizations. Understanding the principles/theory and the technologies underlying distributed computing and systems design is increasingly important. Examples of technologies supporting such deployment include JEE architecture and Web services. Prerequisites: 95-712 Min. grade C or (17-681 and 17-683) Course Website: [http://heinz.cmu.edu/academic-resources/course-results/course-details/index.aspx?cid=295](http://heinz.cmu.edu/academic-resources/course-results/course-details/index.aspx?cid=295)95-717 Writing for Information Systems ManagementAll Semesters: 6 units Communication in written form is an essential element of management. Writing for business-focused, industry-specif...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "90-401",
    "title": "Media & Communication Design IIntermittent: 6 units",
    "department": "Heinz College",
    "description": "The Media and Communication Design course focuses on using desktop publishing software to effectively communicate messages in printed form. The goal of this course is to use the combination of type, color, shapes, illustrations and images to produce professional printed materials. The skills learned in this course can easily be translated to other media. This course will teach a combination of graphic design skills and software skills. Most classes will consist of two thirds lecture and one third hands-on work with the software. The software being taught is Adobe InDesign Creative Cloud (CC), Adobe Illustrator CC and Adobe Photoshop CC. Students will gain experience in preparing documents that are professional in form and content. Student will learn how to design and publish products such ...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "90-403",
    "title": "Gender, Politics and Policies in the US and Across the WorldSpring: 6 units",
    "department": "Heinz College",
    "description": "1.-Women political participation in the U.S. and in selected countries across the world including the expansion of political and voting rights, the role of women as political leaders and the overall participation of women in the political and policymaking process. Within the U.S., we will pay attention to the situation of racial and sexual minorities including African-American and Latina women, as well as issues affecting Lesbian and Transgender Women. 2.-The evolution of women's economic rights in the U.S. and selected countries. Central issues here are the wage gap, the glass ceiling, and the overall female participation in the private sector. 3.-Women in conflict and sex trafficking: Lastly, the course will examine the role of women in conflict as both participants and victims as well a...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "90-404",
    "title": "Poverty Reduction and Social Policies in the USFall and",
    "department": "Heinz College",
    "description": "The goal of this course is to analyze the impact that current U.S. social policies have on reducing poverty and inequality and creating a more just society. The first section discusses the concepts of poverty and inequality, and it is followed by a section on anti-poverty policies pursued in Western Europe. This section includes a discussion of the Welfare State policies in Europe, which have served as a model for universal policies. The bulk of the class is geared to analyzing some of the most critical U.S. social policies including social security, welfare, housing, and health, as well as childcare and child benefits. The policy analysis will emphasize the non-universal nature of the policies and their unequal racial and gender impact. Examples from other countries where those policies h...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "90-427",
    "title": "Healthcare ManagementFall: 6 units",
    "department": "Heinz College",
    "description": "This course introduces students to the knowledge and skills required to strategically manage the rapidly changing internal and external environment of health care organizations. Through readings, lectures, class discussions and case reviews, the course is designed to provide students with a foundation in contemporary health care organizational structures and management practices. Students will explore problems and decisions facing health care executives in areas such as clinical quality, organizational effectiveness, efficiency, growth, stakeholder conflicts, provider incentives, margin versus mission tradeoffs, human resources, strategic planning and the like, all in a highly complex political environment. A primary theme of this course is the application of ethical management practices a...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "90-433",
    "title": "Population HealthIntermittent: 6 units",
    "department": "Heinz College",
    "description": "It is a societal imperative that we improve the quality of health for all Americans while reducing the cost. In so doing, we must move from a reactionary, disease driven, hospital-dominated model to one that creates the appropriate level of incentives and health delivery infrastructure so that patients embrace strategies to prevent disease and promote healthy living and behavior. What is Population Health and what role do individuals, executive branch agencies, and non-profits play in the protection and promotion of positive health outcomes? How are health outcomes assessed? In this introductory course, we will examine the way health care delivery systems, public health agencies, community-based organizations, and many other entities work together to develop interventions to improve the he...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "90-434",
    "title": "Geospatial Health AnalyticsSpring: 12 units",
    "department": "Heinz College",
    "description": "This course is taught with asynchronous video lectures and readings with in-person and remote office hours. A geographic information system (GIS) provides an effective way to visualize, organize and manage a wide variety of information including administrative and medical record data, environmental health, social services, and other location data. Public health departments, hospitals, and medical research agencies are using GIS to map health-related events, identify disease clusters, investigate environmental health problems, and understand the spread of disease. This course uses a unique approach for teaching GIS in health care. It involves learning how to use GIS software in the context of carrying out projects for visualizing and analyzing health-related data. Each week includes lecture...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "90-435",
    "title": "Public FinanceFall: 12 units",
    "department": "Heinz College",
    "description": "The purpose of Public Finance (90-736/ [90-435](http://coursecatalog.web.cmu.edu/search/?P=90-435 \"90-435\")) is to provide an introduction to the theory and practice of how national, regional and local governments should and actually finance their budgets for operating and capital project purposes. To accomplish this, the course reviews: i\\] rationales for government intervention in the market place, ii\\] analyzes methods of resolving conflicts over the size of the public sector budget, iii\\] extensively analyzes the rationales and issues of various types of tax revenue, and iv\\] reviews the effects of public sector spending and taxes on the aggregate economy. Throughout, Public Finance emphasizes the interplay between how current revenue policy is fashioned, and how the models and their k...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "90-440",
    "title": "Critical Analysis of Policy ResearchFall and",
    "department": "Heinz College",
    "description": "This course prepares students to understand, interpret, and critique existing policy research. The course focuses on the development of three essential skills for policy analysts: 1) Read and interpret empirical results in published research. 2) Understand the assumptions needed to infer causal relationships and assess their plausibility. 3) Recognize common problems in policy research, including reverse causality, omitted variables, measurement error, etc., and use graphical methods to determine the direction of the resulting statistical bias. Using these three skills, students will practice understanding and critiquing policy research. Moreover, by identifying and understanding potential problems, students can make valid conclusions even from seriously flawed research. At the end of the ...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "90-443",
    "title": "Urban and Regional Economic DevelopmentIntermittent: 12 units",
    "department": "Heinz College",
    "description": "The course will introduce students to the theory and practice of economic development in the United States. An introduction to basic analytic techniques used by both researchers and economic development practitioners will be coupled with a broad overview of the research literature in the fields of urban and regional economics. Emphasis will be placed on the public sector's role in promoting economic development and public policy at the federal, state and local levels that are focused on improving economic conditions for people, places and regions. Optional readings will focus on Pittsburgh's economic development and regional economic change since WWII.",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "90-445",
    "title": "Social EntreprenuershipIntermittent: 6 units",
    "department": "Heinz College",
    "description": "With a world threatened by rising inequalities (especially in the post-pandemic time) and the effects of climate change, we are in the middle of an era where we are seeing the growth of social entrepreneurship - both in the upsurge of new ventures and within corporations as they seek to respond to demand from their consumers and the public toward a focus not solely on profit, but on a \"triple bottom line\" - an equivalent focus on PURPOSE and #8212; people and the planet. This course is for students that want to learn how to take ideas that respond to societal needs and frame it within a sustainable business structure. Ideas may be for new social ventures or innovations within existing institutions and corporations. The students will work on an idea they have and take it through a model \"ac...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "90-446",
    "title": "Civic Engagement As A Community ProcessIntermittent: 6 units",
    "department": "Heinz College",
    "description": "This course will examine Civic Engagement from the perspective of community and neighborhood issues which are often unstated but form the basis for community tension and lack of trust in the participatory process. Students will learn why the engagement process is valued in a democratic society, practiced locally, and how it is currently transforming to be more effective. While there are no right answers to effective civic engagement, the content and participatory role-playing will introduce students to the complexity of engagement issues, responsibilities, and hands-on facilitation experience to achieve better outcomes for citizens, communities, and practices for community decision and policymaking. New topics will be introduced on a weekly basis through student-led presentations and facil...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "90-449",
    "title": "Elective Politics and Policy-MakingIntermittent: 6 units",
    "department": "Heinz College",
    "description": "Significant proposals in public policy at the local, state and federal level of the U.S. require usually require legislation to become a reality. Enter politicians, politics, and political processes. Elected politicians, both representatives and executives, are the ultimate arbitrators and decision-makers in public policy change. The political process can be very messy. Nonetheless public policy change can be successfully \"engineered\" from an idea to a reality. This course will explore past cases involving elected officials from the Pittsburgh region and Pennsylvania to illustrate the people, politics and processes involved in policy change. Students will then be required to apply what they learn from these cases to a contemporary policy challenge facing the Pittsburgh region. Course Websi...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "90-463",
    "title": "Policy and Leadership in Public EducationFall: 6 units",
    "department": "Heinz College",
    "description": "This course introduces students to policy issues in public education while simultaneously building the skills to lead change through authentic assignments and in-class collaboration. The course addresses both the \"what\" and the \"how\" of leading policy change, combining content presentation and discussion with an iterative approach to each assignment. The content of the course will consist of four aspects of education policy: 1) the basics: the purpose of schooling as well as the current structure and legislative landscape within K-12 public education in the United States, 2) what is taught: policy and practice around curriculum, standards, and assessment, 3) who teaches: human capital strategy and policy and 4) where does education take place: school design and structure, including opportu...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "90-472",
    "title": "Health PolicySpring: 6 units",
    "department": "Heinz College",
    "description": "This course introduces students to the concepts, theories, and tools of health policy. The aims of this course are to provide students with (1) the ability to identify key problems facing the United States health system, (2) increase the appreciation for and understanding of health policy as an important and useful tool for enhancing population health, and (3) mechanisms to address a current health policy issue from legal, economic, behavioral, and political perspectives. In addition, students will be introduced to a cross-national comparison of health systems. Prerequisite: [90-436](http://coursecatalog.web.cmu.edu/search/?P=90-436 \"90-436\") Min. grade C",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "90-474",
    "title": "Public Expenditure AnalysisSpring: 12 units",
    "department": "Heinz College",
    "description": "Public Expenditure Analysis is a 12 unit course designed to deal with the expenditure side of the public sector budget in a series of modules. It has been conceptualized as a blending of private finance and public expenditure principles. The former provides a systematic framework, capital budgeting, for the evaluation of private-sector capital projects, while the latter builds on the former, and introduces issues of externality, the social rate of discount, and incomplete markets through the mechanism of shadow pricing. Public Expenditure Analysis prepares those Heinz and other CMU students seeking careers in the public sector, or those parts of the private sector that routinely deal with the public sector's capital budgeting decisions. It answers the question \"when should a community buil...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "90-489",
    "title": "Resilient & Sustainable CommunitiesIntermittent: 12 units",
    "department": "Heinz College",
    "description": "[90-489](http://coursecatalog.web.cmu.edu/search/?P=90-489 \"90-489\"): This course is a parallel listing for the graduate level listing of [90-789](http://coursecatalog.web.cmu.edu/search/?P=90-789 \"90-789\") under the same title. This course examines past and current community development topics and trends associated with creating and/or maintaining resilient and sustainable communities. Such topics include sustainable development, community equity, creative capitalism, regional planning and visioning, environmental justice, governance, regional equitable development, sustainable business practices, green/clean tech, smart growth and smart transportation, carbon management, resource conservation, local living economies, energy systems and strategies, dynamics of neighborhoods, among other t...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "90-717",
    "title": "Writing for Public PolicyAll Semesters: 6 units",
    "department": "Heinz College",
    "description": "Communication in written form is an essential element of being a public policy professional. Writing for consulting firms, government agencies, think tanks, advocacy groups, industry associations, and other contexts in the sphere of public policy differs from academic writing. Accordingly, this course challenges students to convey critical thinking by anticipating readers' needs and the perspectives of stakeholders in the practice of shaping public policy. The writing skills integral to this process include: developing essential and persuasive content, communicating complex ideas, organizing information, targeting diverse audiences with varying levels of expertise and roles, ensuring clarity, controlling tone, and designing a document for readability. Students analyze real-world documents ...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-003",
    "title": "Contested Histories: The Israel-Palestine ConflictIntermittent: 1 unit",
    "department": "Dietrich College",
    "description": "Join one of several small groups of students, faculty and staff in discussing Neil Caplan's remarkable book \"The Israel-Palestine Conflict: Contested Histories\" (Second Edition). There will be six options for book discussion groups, each led by an expert faculty member, taking place in late February and early March. In-person and remote options will be available. Discussions will explore the contested Palestinian and Israeli narratives of events and aim to move readers beyond assigning blame to wrestling with the complexities and contradictions of the conflict. Is there a chance for peaceful resolution? Registered CMU students who attend a discussion group lead by a university expert and a discussion group with Caplan will receive one unit of academic credit.",
    "units": 1,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-101",
    "title": "Dietrich Introductory Seminar: College & University Success StrategiesFall: 3 units",
    "department": "Dietrich College",
    "description": "This course is designed to help first-year students build a strong foundation for success in the Dietrich College of Humanities and Social Sciences. Through interactive discussions, self-reflection, and hands-on activities, students will develop the skills, mindset, and knowledge necessary to navigate the transition to college life. Students will explore campus resources and opportunities such as undergraduate research, internships, and study abroad to help them make the most of their Dietrich experience. By the end of the course, students will feel more connected to the Dietrich College community and be equipped with the tools needed to navigate their college journey with confidence and purpose. This course is only available to be taken by first-year students in their first semester at Di...",
    "units": 3,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-106",
    "title": "Applied Quantitative Social Science I (QSSS students)Fall: 9 units",
    "department": "Dietrich College",
    "description": "The first course in the QSSS core sequence provides a fast-paced introduction to a range of methods in the quantitative social sciences. Organized around a set of case studies, the course introduces the language and methods of empirical research through a combination of seminar-style discussions of academic papers, and hands-on lab work using the statistical software R. Students will replicate results from a high-profile labor market discrimination paper, explore agent-based models of neighborhood segregation, and scrape Wikipedia data to examine imbalances in gender representation. Enrollment restricted to QSSS students.",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-122",
    "title": "DC Grand Challenge First-Year Seminar: Beyond EarthSpring: 9 units",
    "department": "Dietrich College",
    "description": "The aim in the course is to foster in students a planetary perspective, to see Earth in its context of the cosmos and to see humans in their relation to real or possible forms of life in the universe. The obsession with outer space is found among scientists, business people and politicians, in deed and story, in film and even computer games. If we are to fully appreciate the potentials of space, we must also consider the search for intelligent life in its scientific and societal aspects, and investigate how we could adapt our systems of communication to reach species across distances that may be physically insurmountable. This interdisciplinary course will be taught by scholars from distinct cultural and linguistic backgrounds. Course materials will be taken from scientific literature, the...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-123",
    "title": "DC Grand Challenge First-Year Seminar: Science on StageSpring: 9 units",
    "department": "Dietrich College",
    "description": "Art and Science and #8212; two fields of study that are most often considered diametrically opposed. Art is frivolous entertainment. Science is hard rational fact. In this Grand Challenge course, we hope to break that supposition or at least examine it in great detail. Specifically, we will use theater to argue that drama can produce challenging, demanding and intelligent work that showcases the impact of science on current discourse. We want to link the two cultures. The word \"theater\" has the same etymological root as \"theory\" - both words come from the Greek thea meaning view. This shared origin demonstrates ways we can work to analyze and interpret both fields and show the common ground between these two cultures. As we attend to plays and writing ranging from Tom Stoppards Arcadia and...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-125",
    "title": "DC Grand Challenge First-Year Seminar: Democracy & DataFall: 9 units",
    "department": "Dietrich College",
    "description": "From gerrymandering to online political ads, data is being used in ways that raise urgent questions about the integrity of democratic elections. But the relationship between democracy and data goes far beyond elections. In a world of constant surveillance, in which vast amounts of data are gathered from our phones, our computers, and from other facets of our lives - and in which new breakthroughs in machine learning and data analytics make such data dramatically more powerful - what does it mean for average citizens to have control over their own lives? What does democracy mean?",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-126",
    "title": "DC Grand Challenge First-Year Seminar: Voting: An American TraditionFall: 9 units",
    "department": "Dietrich College",
    "description": "This course investigates the sacred American practice of voting, the cornerstone of American democracy, using the 2020 election cycle as our laboratory. The course uses a multi-disciplinary approach, examining the topic from several different perspectives. We'll investigate social movements to expand the vote, the role of technology, game theory, polling, predictions, electoral mapping, social media, the structures of American governance, and more. Questions include: What is the electoral college? Who gets to vote and why? How well is that vote accounted for? How can voting systems be compromised? Why is it so hard to predict who will win? How do people make decisions? How useful are polling and amp; predictions? What disrupts voting? Why is turnout so low? How does money play a role in th...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-127",
    "title": "DC Grand Challenge First-Year Seminar: Environmental JusticeFall: 9 units",
    "department": "Dietrich College",
    "description": "Wondering what the \"Green New Deal\" proposal is about? Does it seem like you have to choose between protecting people and protecting the planet? How does environmentalism connect to struggles over social justice and human rights? This first-year interdisciplinary seminar is an introduction to the Grand Challenge: Environmental Justice. In Giovanna de Chiro's words, the environmental justice movement is working \"toward building diverse, dynamic, and powerful coalitions to address the world's most pressing social and environmental crises global poverty and global climate change by organizing across scales and 'seeking a global vision' for healthy, resilient, and sustainable communities.\" In this seminar, we'll study the history and science behind two interconnected challenges for environment...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-128",
    "title": "DC Grand Challenge First-Year Seminar: Palestinian and Israeli Food CulturesSpring: 9 units",
    "department": "Dietrich College",
    "description": "In a region beset by conflict, how do food cultures allow us to approach cultural intersections and connections? This course is designed to provide students with a historical, cultural, and linguistic understanding of the hybrid nature of Jewish and Arab cultures, and the multiple ethnic contributions to local food cultures in Israel and Palestine. The two instructors, from the fields of Jewish history and Arabic Studies, will introduce students to the history, literature, film, and languages of the region, as well as to critical scholarship on food and foodways in the Palestinian and Israeli context. Students will have the opportunity to engage in cooking either locally or in Philadelphia - subject to travel restrictions - and to learn from Michael Solomonov and Reem Kassis, two award-win...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-129",
    "title": "DC Grand Challenge First-Year Seminar: Unreality: Immersive and Spatial MediaIntermittent: 9 units",
    "department": "Dietrich College",
    "description": "Virtual news stories and game worlds are accessible by putting on cardboard goggles, theme parks are engineered to provide convincing multisensory experiences, and workforces are reliant on augmented views of factory floors. Immersive and spatial media constitute a suite of emerging technologies that offer the opportunity to expand arts, entertainment, science, design, commercial enterprises and countless other domains in ways that were previously limited to science fiction. The potential for augmented reality to disrupt our current technological ecosystem is tremendous. Many of these technologies are now 50 years old and just starting to enter the commercial realm. As immersive experiences and augmented realities become more integrated into our work and leisure, do we need to worry about ...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-131",
    "title": "DC Grand Challenge First-Year Seminar: Culture, Sports, and Conflict in/and VRIntermittent: 9 units",
    "department": "Dietrich College",
    "description": "Sports have been celebrated for bringing people together; yet, sports have also been a locus of tensions and conflict that most of us only experience from the sidelines. We understand sports, the people, and their cultural impact through the stories that we tell about them in such places as museums, stadium tours, and Halls of Fame as well as in books, documentaries, and podcasts. Through immersive technologies, these stories are brought to life and bring fans to the heart of the action. In this course, students and faculty together will seek to achieve two main objectives: (1) examine ways in which cultural and societal values are reflected in sports and (2) how Virtual Reality (VR) technology can help design experiences that enhance the users' awareness of these issues by engaging with t...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-132",
    "title": "DC Grand Challenge First-Year Seminar: Health in Unhealthy TimesIntermittent: 9 units",
    "department": "Dietrich College",
    "description": "We live in times when health is a major global concern, whether we worry about the increase in Covid-19 cases, await our immunization, strive to understand the disproportionate impact of the disease on BIPOC populations, or debate mitigation measuresnot to mention ongoing concerns with common chronic illnesses such as diabetes, cancer, autoimmune disease, depression, anxiety, etc.. Health, or lack thereof, has always been a critical part of the human experience, and it is fundamentally impacted by different human experiences. This seminar will introduce students to the scientific aspects of health, its political and social determinants, ethical constraints, historical roots, as well as to the cultural and communicative skills required to dialogue about health, make decisions, and engage em...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-133",
    "title": "DC Grand Challenge Seminar: We're Not Beyond Race: Race and Identity in AmericaIntermittent: 9 units",
    "department": "Dietrich College",
    "description": "Race matters. How have social institutions and historical factors led to the belief systems and stereotypes that shape how race is experienced in American society, and how do these belief systems affect the way individuals come to view and define themselves and others? This course considers how race and identity affect peoples lived experiences - how they think, feel, and act - in America. In this course, we will examine the structural and systemic origins of the racial status quo, as well as the way that individuals navigate the social and racial landscape of modern-day America. Including insights from psychology, literature, economics, sociology, and history, the course will focus on how race matters at both a societal level and an individual level. We will consider different racial situ...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-134",
    "title": "DC Grand Challenge First-Year Seminar: Native Americas: Facts and FictionsIntermittent: 9 units",
    "department": "Dietrich College",
    "description": "How did Indigenous people respond to the challenges of populating the American hemisphere and creating complex, diverse and dynamic cultures, languages and political entities? How did they survive, adapt to, and resist the conquest and colonization of their lands, and ensuing social and cultural dislocations? How have they resurged politically, culturally, artistically and intellectually in recent years? This course considers the history, experiences, and perspectives of native populations across the Americas. It seeks to reckon with the facts of the Native American experience, while challenging the fictions of stereotypes and narratives that have often relegated Indigenous people to the social and cultural margins of the nations in which they now live. After introducing students to a few ...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-135",
    "title": "DC Grand Challenge First-Year Seminar: Designing Better Human-AI FuturesIntermittent: 9 units",
    "department": "Dietrich College",
    "description": "This course will explore the societal impacts of artificial intelligence (AI) based decision-making systems, especially focusing on the societal biases they may enhance or reduce. Students will gain a fundamental understanding of how these systems are designed and work, as well as the role of data in mitigating or enhancing biases. The course is multidisciplinary in nature and brings together social scientists, engineers, data scientists, and designers to tackle the grand challenge of dealing with issues of bias and fairness in Human-AI collaborative systems, ranging from the data that is used to train them, to their human creators that are responsible for deciding how they work and get used. Students will investigate policy, technology and societal elements aimed at reducing and mitigatin...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-136",
    "title": "DC Grand Challenge First-Year Seminar: Becoming Resilient in Challenging TimesSpring: 9 units",
    "department": "Dietrich College",
    "description": "What does it mean to be resilientemotionally, relationally, and collectivelyin the face of disruption, uncertainty, or change? In this course, we define resilience as an intersectional capacity of individuals, communities, and systems to adapt, recover, and grow in response to adversity, disruption, or changedrawing on psychological, social, ecological, and artistic resources to sustain well-being and support transformation. We'll explore these layers through the lens of graphic storytelling, using comics and visual narratives to examine stories of wellness, identity, trauma, and individual/ collective recovery across cultural contexts. Drawing from works originally written in English or Spanish (all readings available in English), we'll explore how artists use color, composition, symbo...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-137",
    "title": "DC Grand Challenge Seminar: Causes and Consequences of Health DisparitiesSpring: 9 units",
    "department": "Dietrich College",
    "description": "Why do some people live well into their nineties while others are more likely to die at an earlier age? The answer to this question can be more complex than one might think. Life expectancy can be influenced by a host of individual and population-level factors. This course is designed to critically examine the social factors research has found to impact individual and population health experiences. This course will introduce students to the multiple approaches to researching the complex problem of health disparities in the United States with particular emphasis on perspectives from the social sciences and humanities. Specifically, students will examine how factors such as socioeconomic status, education, crime, housing, health care and food availability play important roles in the producti...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-138",
    "title": "DC Grand Challenge First-Year Seminar: Militarizing Freedom Arms in U.S. CultureSpring: 9 units",
    "department": "Dietrich College",
    "description": "This seminar examines the way American culture and politics have utilized the tools, tactics, and values of the military during both war and peacetime. Utilizing several disciplinary perspectives, including history, rhetorical criticism, fictional narrative, and the discourse of public policy, we will consider the different ways that gun culture, military mobilization, veteran affairs, and police power have influenced American society, including how people relate toor fearone another. We will explore some historical roots of the U.S.'s militarized culture, alongside the linguistic, argumentative, and narrative trends that have contributed to urgent democratic issues like police brutality, domestic terrorism, and the rise of the carceral state. This course will address themes and questions ...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-139",
    "title": "DC Grand Challenge Seminar: Reducing Conflict Around Identity and PositionalitySpring: 9 units",
    "department": "Dietrich College",
    "description": "Learning to reduce conflict requires understanding positionality and identities, and why and how societies build barriers in their populations. In this interdisciplinary course, students will learn how to talk to each other and strangers about identity: its defining characteristics and how our bias influences our judgments. The social sciences elements will stress Social Identity Theory, bias, stereotypes, and in-groups and out-groups. The humanities elements will include close-reading strategies and incorporate conceptual frameworks from cultural studies, literary studies, and narrative theory. In addition to practicing the methodologies in these two disciplines, students will undertake two projects. In the first project, they will develop and implement a semi-structured interview protoco...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-140",
    "title": "Grand Challenge Seminar: Equitable Access and Success in Higher Education at CMUSpring: 9 units",
    "department": "Dietrich College",
    "description": "Recent U.S. Supreme Court decisions on affirmative action have reignited the debate about equitable access to higher education. Affirmative action has been challenged many times, which highlights the complex nature of providing equitable access to higher education in a society that is not \"equal\" on many measures. Students from historically marginalized communities are often at a disadvantage when it comes to accessing higher education. Even those who are admitted to college may not have the tools or resources to succeed. Throughout its history, and especially since the 1960s, Carnegie Mellon has undertaken multiple initiatives to provide equitable education to underserved populations. This course explores these initiatives, both past and present, as well as the broader debates about affir...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-141",
    "title": "DC Grand Challenge Seminar: Freedom of Speech & Academic FreedomIntermittent: 9 units",
    "department": "Dietrich College",
    "description": "This Grand Challenge course offers a comprehensive exploration of the principles, controversies, and significance of Freedom of Speech (FOS) and Academic Freedom (AF). By exploring actual and hypothetical cases, students will analyze the complex dilemmas that arise when we try to balance two interests: maximizing freedom of expression and creating an inclusive, respectful community. By engaging a wide range of disciplinary perspectives and methods of inquiry from philosophy, history, psychology, law, etc., students will examine how different policies and norms impact these competing interests and vice versa. Students will practice informed and constructive dialogue within the seminar to facilitate independent thought, rigorous inquiry, and how to discuss difficult topics productively. Cour...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-142",
    "title": "DC 1st Year Seminar: Surviving & Thriving in the Information AgeSpring: 9 units",
    "department": "Dietrich College",
    "description": "The average person today has access to a vast amount of information, far and away exceeding what was available to previous generations. However, this information flow is increasingly shaped by algorithms and artificial intelligence, influencing how we perceive and interpret it. This Grand Challenge course will examine the complexities of living in a world of information overload, especially when much of it is algorithmically delivered. Integrating the perspectives of computer science, cognitive science, neuroscience and philosophy, we will explore the nature of information, its structure, and the connection between information and meaning. We will then shift to studying the process of learning, focusing on its core principles and how human learning interacts with the information we encount...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-143",
    "title": "DC Grand Challenge Seminar: Achieving Justice, Equity, and FreedomSpring: 9 units",
    "department": "Dietrich College",
    "description": "This course will introduce first year students to the challenge of protecting and promoting human rights in a world fraught with conflict, political strife, economic exploitation, and environmental hazards. We will focus on how human rights frameworks can be used to make the world more just, equitable, and free. We will begin by discussing the theoretical foundations of human rights and the development of human rights institutions in the 20th century. Students will learn how rights have been constructed through legal action, activism, and treaty negotiations in the past and examine the emergence and contestation of new rights today. We will explore why particular rights frameworks are privileged in some societies but not others. We will then focus on how practitioners investigate and docum...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-144",
    "title": "DC Grand Challenge Seminar: In Transit: Exile, Migration, and CultureSpring: 9 units",
    "department": "Dietrich College",
    "description": "The world is currently experiencing the worst refugee crisis since the end of World War II. Large numbers of people are forced from home for political, personal, or racial reasons, and many others leave home because of grinding poverty and need. Conflicts about the mass migration provoked by this crisis have emerged all over the globe, from the United States, Latin America, and Europe, to Africa, the Middle East, Asia, and even Oceania. Writers, filmmakers, and artists have attempted to address the plight of refugees and migrants in their works, and many writers, filmmakers, and other artists are themselves refugees or migrants. Pittsburgh has a unique institution, City of Asylum, whose mission is to assist and advocate for persecuted writers and other artists. It hosts the largest residen...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-145",
    "title": "DC First Year Seminar: Appalachia: Development, Decline, and Identity in AmericaSpring: 9 units",
    "department": "Dietrich College",
    "description": "The Appalachian region, which stretches from Georgia to New York's southern tier, has a particular place in American history and memory. This course will examine the political, literary, economic, and historical narratives that surround the region, as well as examining the role that Appalachia can play as a model for developing regions in other parts of the world. The paradoxes of Appalachia have confronted American culture since its first settlement by Europeans in the 18th century: a region of unparalleled biodiversity, it has nevertheless been characterized by ongoing poverty and isolation. Politically, it has given rise to both progressive collective action and conservative rhetoric. Economically, its natural resources have been widely exploited by outside economic and industrial inter...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-146",
    "title": "DC 1st Year Seminar: From Pandemics to Politics: Modeling Complex Social SystemsFall: 9 units",
    "department": "Dietrich College",
    "description": "Most of the major issues confronting humanity-such as injustice, discrimination, climate change, financial collapse, ecosystem survival, and disease epidemics-are the result of complex social systems. Such systems have multiple interacting parts that create a whole that is radically different than its constituent parts. Unfortunately, traditional scientific methods that focus on reducing systems to their parts and then analyzing each part provide little insight into complex systems. In this seminar, we will explore the behavior of complex social systems including issues such as discrimination and injustice. We will examine how to model and understand social issues using various tools such as computation and game theory, and various field perspectives including economics, finance, philosoph...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-147",
    "title": "DC Grand Challenge First-Year Seminar: (Mis)Trust in ResearchFall: 9 units",
    "department": "Dietrich College",
    "description": "Why is there declining public trust in research and expertise? What kinds of skills are needed to assess the quality of research, and how prevalent are they in the general public? Finally, what can experts do to address the erosion of trust in research? This course will allow students to investigate the various causes of declining trust in research, such as data manipulation, plagiarism, and conflicts of interest in how research is funded, among others. We will explore the various disciplinary perspectives on research validity, and compare and contrast these with public perspectives on research validity. Along the way, students will be introduced to evidence synthesis methodology, a broad research approach that allows researchers to assess large bodies of literature and find points of cons...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-148",
    "title": "Introduction to Community EngagementIntermittent: 3 units",
    "department": "Dietrich College",
    "description": "This course is designed to prepare students to actively and thoughtfully engage in their community. Students will evaluate various models for community engagement and community-based leadership and examine ethical and social justice issues related to college and university involvement in the community. Through course discussions and direct engagement with community leaders, students will develop the ability to consider multiple perspectives, demonstrate cultural humility and critically reflect to make meaning from experiences. Students will create a plan to infuse community engagement into their academic journey that aligns with their values. This is part of the Dietrich College Community Engagement Fellowship and is only open to students that have been accepted into the program.",
    "units": 3,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-151",
    "title": "DC Grand Challenge First-Year Seminar: Equity and the EnvironmentFall: 9 units",
    "department": "Dietrich College",
    "description": "How does air quality in one city differ from air quality in another? Do citizens have a right to clean air, regardless of where they live? How does global climate change impact the discussion of environmental and human health? The answer to these and other questions about environmental quality are complex and manifest at global and local levels. Access to environmental \"justice,\" that is, the right to a healthy environment, is linked to social factors like race, ethnicity, indigenous identity, income, educational status, and geographic location, among others. By analyzing the case of Pittsburgh, a city in the rust belt and Appalachian region that is working to \"reimagine\" its environmental identity, students will trace past environmental issues and define current environmental concerns tha...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-152",
    "title": "Dietrich College Grand Challenge Seminar: Gender: Contemporary IssuesIntermittent: 9 units",
    "department": "Dietrich College",
    "description": "In recognition of the ubiquity of gender in politics, this course fosters a constructive dialogue on several contemporary debates on issues of gender. These issues will be addressed from a multi-disciplinary perspective, in particular humanistic and social psychological approaches. Varied assessments are included in the course to encourage vigorous engagement with the material, including short paper, debate, journaling, poster, and oral presentation. Students will have opportunities to work collaboratively and individually on projects engaging topics such as intersectionality, single-sex education, reproductive justice, trans issues, and precarious masculinity. Course Website: [https://www.cmu.edu/dietrich/gened/fall-2021-and-beyond/year-1/grand-challenge/index.html](https://www.cmu.edu/di...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-182",
    "title": "Grand Challenges Seminar: Preserving History with Blockchain TechnologySpring: 9 units",
    "department": "Dietrich College",
    "description": "Historical information, artifacts, and relics provide a window to our past and help us understand our present and foresee and prepare for the future. During times of conflict and internecine warfare, it is essential to preserve objects of historical and cultural heritage. Blockchain is a block of data chained together. It does three noteworthy things: 1. digitization, 2. tracing, and 3. security. For any non-digital historical data, Blockchain can provide digitization. For any data that requires tracing, such as scientific findings, religious information, or scriptures (including Hadith/sayings of the Prophet (s)), so on, tracing can play a pivotal role in going back to the originator and understanding the change on the way, as well as preserving it from any changes (which is part of secur...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-195",
    "title": "Documenting Israeli and Palestinian Food Cultures: Teaching and TravelSpring: 9 units",
    "department": "Dietrich College",
    "description": "How does the study of food cultures allow us to approach cultural intersections, conflict, and peacemaking, especially in a region as fraught as Israel and Palestine? This course, cotaught by CMU faculty in the departments of History, Modern Languages, and the Entertainment Technology Center, is designed to provide students with a historical and cultural background about the hybrid nature of Jewish and Palestinian-Arab cultures and the multiple ethnic contributions to food cultures in Israel/Palestine, as well as with media-tech skills, with the aim of preparing them for travel to Israel and the West Bank during Spring Break 2023. In the weeks leading up to the trip, the professors will introduce students to the history, literature, film, and language(s) of the region, as well as to critic...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-215",
    "title": "The Innovation TrialsFall: 9 units",
    "department": "Dietrich College",
    "description": "This course will examine some of the most influential intellectual property court battles throughout history and their impact on innovation. This course is geared toward students curious about Americas industrial development and interested in the political and business strategies behind the greatest innovations and technological advances of the past several centuries. The course will answer the who, what, where, when, why and how of a number of legal cases involving various technologies and areas of innovation and place them in their historical context.",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-216",
    "title": "Connecting with the Pittsburgh CommunitySpring: 6 units",
    "department": "Dietrich College",
    "description": "This course is designed to engage students in an exploration of various communities within the Pittsburgh area. Students will examine the ways that local organizers have been able to effectively promote positive social change. Students will develop the ability to honor the histories of diverse communities in the region while learning about the communities and the ingredients of successful communities. This course is part of the Dietrich College Community Engagement Fellowship and is only open to students who have been accepted into the program. Prerequisite: [66-148](http://coursecatalog.web.cmu.edu/search/?P=66-148 \"66-148\")66-221 Topics of Law: Introduction to Intellectual Property LawIntermittent: 9 units This course provides students with an overview of patent, trademark, copyright, an...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-225",
    "title": "Politics, Persuasion, and the PressIntermittent: 6 units",
    "department": "Dietrich College",
    "description": "This course, conducted in the wake of a brutal presidential election, an assault on the Capitol, and a second impeachment, is intended to examine American politics and to look at how the political system in the United States and its interchange with the press shape the process of making policy. It is one part history, one part political science, one part policy studies, with special emphasis on local and national politics. In this course, students will be exposed to the 18th century Constitutional origins of the American political system as well as the 21st century implications of the American political systemall in the context of political upheaval in a country that, until recently, cultivated an air of stability. Through challenging readings, guest speakers, and yeasty class conversation...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-226",
    "title": "Law and LiteratureIntermittent: 9 units",
    "department": "Dietrich College",
    "description": "This course offers a real-time understanding of significant legal issues that undergraduates, including those who might be considering careers in law, need to know about. Even those not specifically interested in law will benefit from the medium we use, which is that of imaginative fiction. Scenes from stories (and some films and popular culture media) that deal with law provoke our dicussions, including well known trial scenes (MERCHANT OF VENICE \\[Shakespeare\\], BILLY BUDD SAILOR \\[Melville\\]), portraits of men and women in the profession of law (GREAT EXPECTATIONS \\[Dickens\\], THE FALL \\[Camus\\], \"A Jury of Her Peers\" \\[Glaspell\\]; and narratives that show how the rhetoric of law sometimes fails to grasp the problems of less powerful communities (TO KILL A MOCKINGBIRD \\[Lee\\]; THE FIXER...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-236",
    "title": "Introduction to Environmental IdeasFall and",
    "department": "Dietrich College",
    "description": "By recognizing that environmental problems are themselves complex and require insights from social, political, and scientific perspectives, the interdisciplinary Program in Environmental and Sustainability Studies (ESS) prepares students to gain proficiency in different disciplinary habits of thinking. As part of this endeavor, students take part in informed discussions about interpretive lenses; ways of seeing; and thinking about social, cultural, and historical contexts for interpretations of environment and sustainability. This seminar-style course introduces key methods and approaches for interdisciplinary inquiry within a framework of Environmental Humanities and Environmental Justice. Scholar Giovanna de Chiro writes: \"The term 'environmental justice' emerged from the activism of com...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-300",
    "title": "Using Collective Leadership to Pursue Community GoalsFall",
    "department": "Dietrich College",
    "description": "This course serves as the third required course in the Dietrich College Community Engagement Fellowship. This course is designed to further prepare students to actively and thoughtfully engage alongside a community focusing on a topic of the students choice. This course will bring together prior topics of cultural humility, asset-based framing, cultural competence, and community-based leadership models alongside additional topics (such as collective leadership, tailored community-focused communication, among others) responsive to their community-based learning experiences. This will prepare students to narrow their focus on a topic and community in preparation for their capstone project. Prerequisites: [66-148](http://coursecatalog.web.cmu.edu/search/?P=66-148 \"66-148\") and [66-216](http:/...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-310",
    "title": "Reflecting on Experiential LearningAll Semesters: 1 unit",
    "department": "Dietrich College",
    "description": "This asynchronous course is used to fulfill the Dietrich College General Education Experiential Learning requirement. Experiential Learning occurs when a student participates in an opportunity that allows them to apply what they are learning in the classroom to a real-world context. This may include internships, undergraduate research with a faculty member, community engaged learning, study abroad or work-based learning through structured consulting projects. This course serves as a complement to an experiential learning activity and students enrolled are expected to engage in critical reflections about their experience. Registration is by permission-only; contact the Experiential Learning Team at dietrichexperiential@andrew.cmu.edu",
    "units": 1,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-320",
    "title": "Dietrich College InternshipAll Semesters",
    "department": "Dietrich College",
    "description": "Internships-for-credit allow students to apply course-based knowledge in a non-classroom setting, under joint supervision and evaluation by an on-site supervisor and a faculty sponsor. Approved internships must conform to college guidelines for internships-for-credit, and are available by permission only arranged through Director of Experiential Learning, Baker Hall 160. Interested students should contact dietrichexperiential@andrew.cmu.edu.",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-400",
    "title": "Dietrich College Senior Honors ColloquiumFall: 1 unit",
    "department": "Dietrich College",
    "description": "The purpose of this course is to provide students admitted to the Dietrich College Senior Honors Program with a shared set of intellectual and practical sessions that will enhance their senior honors thesis experience. The course will consist of seven bi-weekly 80-minute meetings. Each will be organized around a theme and related topics that are relevant to the senior honors thesis experience, and that take advantage of both the high caliber and interdisciplinary diversity of the course members. Guest visitors will also be a common feature of the course. Topics could include: the meaning(s) of \"honors;\" getting started and keeping pace: the ebb and flow of an independent research project (including how to recognize and avoid procrastination; forging a successful relationship with your thes...",
    "units": 1,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-402",
    "title": "Dietrich Leadership Development SeminarFall and",
    "department": "Dietrich College",
    "description": "The Dietrich Leadership Development Seminar is for juniors and seniors in Dietrich College wishing to advance their understanding of leadership theory and practice and to develop their own skills in this regard, while creating a context for their lifelong leadership development. The course is predicated on a six pillar model proposing that ideal leaders must at once be visionary, ethical, engaging, tactical, technical - including sub-expert conversancy in realms beyond their own expertise, and reflective - including both personal mindfulness and assessment against clear metrics. In this context, the course includes a focus on strategic planning, teamwork, cultural awareness, conflict resolution, risk management, sustainability and personal welfare, professionalism, personal financial plann...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-403",
    "title": "Community Engagement Fellowship CapstoneSpring",
    "department": "Dietrich College",
    "description": "This course serves as the final component of the Dietrich College Community Engagement Fellowship and is designed to engage students in completion of their culminating project. The course will build on students' work in the previous semester in which they identified a community, established an understanding of the community goals and proposed a plan to pursue one of these goals. During the semester, students will implement their capstone project utilizing the knowledge and skills developed during earlier stages of the program. Working with a mentor who is also a community stakeholder, students will implement their project, solicit feedback from the community, evaluate project effectiveness and make appropriate changes. Students will also articulate ways their project can be sustained and p...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-504",
    "title": "Senior Capstone IAll Semesters: 9 units",
    "department": "Dietrich College",
    "description": "Dietrich College student-defined majors (primary or additional) must complete a senior capstone project for at least 9 units (in one semester), or 18 units across both semesters of the senior year. The capstone project culminates in an original independent research or creative project that draws on all of the strands of the student's particular student-defined program. This course is the first in a two-course capstone sequence open only to seniors who have been admitted to the Dietrich College Student-Defined Program as a primary or additional major, and who choose the two-semester capstone sequence option. The second course in the sequence is [66-505](http://coursecatalog.web.cmu.edu/search/?P=66-505 \"66-505\"), Senior Capstone II. Projects are proposed by eligible students, and must be ap...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-505",
    "title": "Senior Capstone IIAll Semesters: 9 units",
    "department": "Dietrich College",
    "description": "Dietrich College student-defined majors (primary or additional) must complete a senior capstone project for at least 9 units (in one semester), or 18 units across both semesters of the senior year. The capstone project culminates in an original independent research or creative project that draws on all of the strands of the student's particular student-defined program. This course is the second in the two-course capstone sequence, and is open only to seniors who have been admitted to the Dietrich College Student-Defined Program as a primary or additional major, and who have chosen the two-semester capstone option. The first course in the sequence is [66-504](http://coursecatalog.web.cmu.edu/search/?P=66-504 \"66-504\"), Senior Capstone I. Projects are proposed by eligible students, and must ...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "66-506",
    "title": "Senior CapstoneAll Semesters: 9 units",
    "department": "Dietrich College",
    "description": "Dietrich College student-defined majors (primary or additional) must complete a senior capstone project for at least 9 units (in one semester), or 18 units usually spread across both semesters of the senior year. The capstone project culminates in an original independent research or creative project that draws on all of the strands of the student's particular student-defined program. This course is a one-semester option for student-defined majors who propose a 9-unit/one-semester capstone project; it is also an 18-unit/one-semester alternative to the two-semester Senior Capstone sequence ( [66-504](http://coursecatalog.web.cmu.edu/search/?P=66-504 \"66-504\")/ [66-505](http://coursecatalog.web.cmu.edu/search/?P=66-505 \"66-505\")) for Dietrich College student-defined majors who choose the 18-u...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "65-198",
    "title": "Research Training: HistoryIntermittent: 9 units",
    "department": "Dietrich College",
    "description": "For Fall 2021: The Pittsburgh Queer History Project The Pittsburgh Queer History Project (PQHP) is an ongoing research effort to collect and catalog archival material that document the experiences of LGBTQ people in Pittsburgh and its environs from the second half of the 20th century to the present. The PQHP is co-directed by Prof. Tim Haggerty, the Director of the Humanities Scholars Program and Dr. Harrison Apple, a BXA graduate of Carnegie Mellon who received a doctorate degree from the University of Arizona in 2021, studying with the noted trans scholar Susan Stryker. Students will meet with community activists, learn how to conduct community outreach, organize archival material, and help formulate research questions based on these documents. There is no prior experience needed. The Di...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "65-200",
    "title": "Applied Quantitative Social Science IFall: 9 units",
    "department": "Dietrich College",
    "description": "The first course in the QSSS core sequence provides a fast-paced introduction to a range of methods in the quantitative social sciences. Organized around a set of case studies, the course introduces the language and methods of empirical research through a combination of seminar-style discussions of academic papers, and hands-on lab work using the statistical software R. Students will replicate results from a high-profile labor market discrimination paper, explore agent-based models of neighborhood segregation, and scrape Wikipedia data to examine imbalances in gender representation. Enrollment restricted to QSSS students.",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "65-201",
    "title": "Pathways in the HumanitiesFall",
    "department": "Dietrich College",
    "description": "Fall 2025: In this seminar, HSP students will have the first-hand opportunity to explore the ways in which their educations in the humanities prepare them for future experiences and careers. Students will participate in a series of guided reflections about their own interests and strengths, and network with alumni and professionals in a variety of fields; alumni and other guests will regularly participate in class discussions, in person or via zoom. As part of their coursework, students also will learn about scholarship, internship and job opportunities, and participate in a workshop geared toward helping them prepare cover letters, resumes, proposals, and applications. For those majors who already have a similarly-focused course, students can take for fewer credits, while further building...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "38-100",
    "title": "CATALYST - MCS First-Year SeminarFall and",
    "department": "Mellon College of Science",
    "description": "The CATALYST seminar will equip transfer students to MCS, as well as those students who did not successfully complete the EUREKA seminar, with foundational knowledge, skills and perspectives that will support their development as emerging scientists and scholars. During the seminar, students will be presented with opportunities and experiences designed to help them frame how the MCS curriculum aspires to shape their evolving identities in the areas of scholar, person, professional and citizen, while also engendering a sense of excitement about science and scientific inquiry. The seminar will offer information and strategies that are employed both by successful students and by successful scientists in optimizing their approach to work and life, with a key focus on areas such as cognitive le...",
    "units": 3,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "38-101",
    "title": "EUREKA!: Discovery and Its ImpactFall: 6 units",
    "department": "Mellon College of Science",
    "description": "The MCS first-year seminar \"EUREKA: Discovery and Its Impact\" will equip new students with foundational knowledge, skills and perspectives that will support their development as emerging scientists. During the seminar, students will be presented with opportunities and experiences designed to help them frame how the MCS curriculum aspires to shape their evolving identities in the areas of scholar, person, professional and citizen, while also engendering a sense of excitement about science and scientific inquiry. The seminar will offer information and strategies that are employed both by successful students and by successful scientists in optimizing their approach to work and life, with a key focus on areas such as cognitive learning skills, research, teamwork, goal setting, time management,...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "38-110",
    "title": "ENGAGE in ServiceAll Semesters: 1 unit",
    "department": "Mellon College of Science",
    "description": "ENGAGE in Service is a 1-unit course (9 hours of work, minimum requirement for a passing grade) designed to promote MCS students' direct engagement with community development and service learning. To fulfill this requirement, students must engage in a minimum of 9 hours of work devoted to a non-profit organization or organizations of their choice, 3 of which must have a direct benefit to the local Pittsburgh community. Students may complete the requirements anytime during their undergraduate years, but must register for the class during the semester that they intend to complete it, no later than their penultimate semester. Coursework includes documentation of service via completion of a form for each eligible activity that includes a time log, a description of the activity, the name and co...",
    "units": 1,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "38-132",
    "title": "DC Grand Challenge First-Year Seminar: Health in Unhealthy Times: Preventing, MaIntermittent: 9 units",
    "department": "Mellon College of Science",
    "description": "We live in times when health is a major global concern, whether we worry about the development of novel Covid-19 mutations or continue to grapple with chronic illnesses such as obesity, diabetes, autoimmune diseases, cancer as well as depression and anxiety. Health and illness are key drivers of the human experience. And yet, health is fundamentally impacted by different human experiences. This first year Grand Challenges seminar will introduce students to core concepts in the life sciences that will enable them to better appreciate the scientific aspects of health. Building on this knowledge, students will then explore important psychosocial determinants, ethical constraints, and historical roots of health. Students will also develop a familiarity with the cultural and communicative skill...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "38-220",
    "title": "ENGAGE in the ArtsFall and",
    "department": "Mellon College of Science",
    "description": "ENGAGE in the Arts is part of Mellon College of Science's Core Curriculum. In this 2-unit full-semester course, students will broaden their knowledge of the fine arts, extend their global and cultural awareness, and facilitate the further development of their self-identity. Coursework requires that students attend 8 distinct arts events, 2 of which must engage with a culture different from one's personal cultural background. In choosing events, students should be imbued with an attitude of openness to new ideas and a willingness to try something new. The course requires students to share, reflect, and document their participation in a variety of arts events by engaging with classmates and instructors through MyCORE, where they can upload coursework and find postings for events. Coursework ...",
    "units": 2,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "38-230",
    "title": "ENGAGE in Wellness: Looking InwardSpring: 1 unit",
    "department": "Mellon College of Science",
    "description": "ENGAGE in Wellness: Looking Inward is a 1-unit mini-course that MCS students will enroll in the spring of the sophomore year, designed to give students a holistic understanding of their own personal wellness. The course is structured around the concept of a Wellness Wheel, a model for personal wellness that is used to describe the various areas that students should reflect upon when describing, and ultimately improving, their overall wellness. The MCS Wellness Wheel has nine components: intellectual, physical, emotional, spiritual, environmental, institutional or community, financial, social, and occupational health. During this first course, taken in the first mini of the sophomore year, students will select one of three areas on which to focus: intellectual, emotional or physical health....",
    "units": 1,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "38-301",
    "title": "PROPELSpring: 6 units",
    "department": "Mellon College of Science",
    "description": "PROPEL: Preparation, Readiness, and Optimization for Professional Excellence in Life - is a 6-unit seminar course that MCS students will enroll in the spring of their junior year. The course will leverage students' deepening disciplinary perspective in service of the development of competencies, skills and perspectives that are necessary to achieve professional excellence in today's society. The course will use traditional career development activities, such as interviewing, resume writing and networking, as a starting point for students to begin the process of reflecting on, and preparing for, their impending transitions into professional life. From there, the course will seek to expand students' conceptualization of the scientific workplace by exploring the interplay of science, innovati...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "38-304",
    "title": "Reading and Writing ScienceSpring: 6 units",
    "department": "Mellon College of Science",
    "description": "This course is designed to hone the student's ability to read scientific writing and to communicate about scientific topics to audiences with different levels of interest and expertise in science. This course introduces students to frameworks for identifying the linguistic features of scientific argumentation in research papers across a range of scientific disciplines to improve their reading and writing of scientific content. The course also examines how scientific information changes when it is reported in the popular media and the effects these changes have on non-experts' understanding of science. Students will use these changes as a model for writing about scientific research to non-expert audiences. Finally, this course gives students the opportunity to practice science communication...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "38-330",
    "title": "ENGAGE in Wellness: Looking OutwardFall and",
    "department": "Mellon College of Science",
    "description": "ENGAGE in Wellness: Looking Outward is a 1-unit mini-course that MCS students will enroll in the fall of the junior year, designed to give students a holistic understanding of their own personal wellness. The course is structured around the concept of a Wellness Wheel, a model for personal wellness that is used to describe the various areas that students should reflect upon when describing, and ultimately improving, their overall wellness. The MCS Wellness Wheel has nine components: intellectual, physical, emotional, spiritual, environmental, institutional or community, financial, social, and occupational health. During this second course, taken in the first mini of the junior year, students will select one of three areas on which to focus: spiritual, environmental and institutional or com...",
    "units": 1,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "38-402",
    "title": "MCS Leadership Development SeminarFall and",
    "department": "Mellon College of Science",
    "description": "This course is designed for 3rd-year and 4th-year Mellon College of Science students committed to further developing their leadership skills and potential for sustained impact in the future. The course will be substantive and engaging, while also ideally thought provoking, edifying, and enjoyable. The course will build on the foundation of six key leadership pillars, identified to hone each students professional and personal development to serve others, and to seek out and nurture opportunities to heighten ones capacity as a person and leader who is: VISIONARY, with clear goals for yourself, your organizations and communities, and others in whose lives you are a part, including the broader society; ETHICAL, with core values and steadfastness in the face of competing objectives, and the res...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "38-430",
    "title": "ENGAGE in Wellness: Looking ForwardFall and",
    "department": "Mellon College of Science",
    "description": "ENGAGE in Wellness: Looking Forward is a 1-unit mini-course that MCS students will enroll in the fall of the senior year, designed to give students a holistic understanding of their own personal wellness. The course is structured around the concept of a Wellness Wheel, a model for personal wellness that is used to describe the various areas that students should reflect upon when describing, and ultimately improving, their overall wellness. The MCS Wellness Wheel has nine components: intellectual, physical, emotional, spiritual, environmental, institutional or community, financial, social, and occupational health. During this third course, taken in the first mini of the senior year, students will select one of three areas on which to focus: financial, social and occupational health. They wi...",
    "units": 1,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "38-701",
    "title": "Special Topics in Science & MathIntermittent: 3 units",
    "department": "Mellon College of Science",
    "description": "Special Topics in Science and amp; Math. Topics will vary depending on the semester and instructor. Please read the individual section descriptions for more information. [Back to top](http://coursecatalog.web.cmu.edu/schools-colleges/melloncollegeofscience/courses/#header) Close this window - [Send Page to Printer](http://coursecatalog.web.cmu.edu/schools-colleges/melloncollegeofscience/courses/#) Print this page. - [Download Page (PDF)](http://coursecatalog.web.cmu.edu/schools-colleges/melloncollegeofscience/courses/courses.pdf) The PDF will include all information unique to this page.",
    "units": 3,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "39-109",
    "title": "Grand Challenge Freshman Seminar: Climate ChangeFall and",
    "department": "College of Engineering",
    "description": "Climate change is considered by many the most serious social, political, and environmental issue of the 21st century. As human activities increase the level of greenhouse gases in the atmosphere, scientists have established the reality of climate change and have estimated its impacts on human society and the natural world. Despite the scientific consensus on its existence, causes, and consequences, a substantial number of Americans and citizens of other countries still question these conclusions and a small but vocal group of doubters continue to challenge the science and scientific consensus on climate change. In spite of some social division over these issues, governments at local, national, and international levels have made concerted efforts to craft policies to address climate change....",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "39-135",
    "title": "DC Grand Challenge First-Year Seminar: Designing Better Human-AI FuturesIntermittent: 9 units",
    "department": "College of Engineering",
    "description": "This course will explore the societal impacts of artificial intelligence (AI) based decision-making systems, especially focusing on the societal biases they may enhance or reduce. Students will gain a fundamental understanding of how these systems are designed and work, as well as the role of data in mitigating or enhancing biases. The course is multidisciplinary in nature and brings together social scientists, engineers, data scientists, and designers to tackle the grand challenge of dealing with issues of bias and fairness in Human-AI collaborative systems, ranging from the data that is used to train them, to their human creators that are responsible for deciding how they work and get used. Students will investigate policy, technology and societal elements aimed at reducing and mitigatin...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "39-210",
    "title": "Experiential Learning IFall and Spring",
    "department": "College of Engineering",
    "description": "The engineer of the 21st century will need to operate effectively in many settings and often with a global perspective. Being curious and constantly looking for inspiration are critical for lifelong learning. This course, designed for all CIT sophomores, requires the student to choose and experience activities for development and growth that are not part of formal course work. Acceptable experiences are listed in the course syllabus on Canvas.",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "39-220",
    "title": "Experiential Learning IIFall and Spring",
    "department": "College of Engineering",
    "description": "The engineer of the 21st century will need to operate effectively in many settings and often with a global perspective. Being curious and constantly looking for inspiration are critical for lifelong learning. This course, designed for all CIT sophomores, requires the student to choose and experience activities for development and growth that are not part of formal course work. Acceptable experiences are listed in the course syllabus on Canvas. Prerequisite: [39-210](http://coursecatalog.web.cmu.edu/search/?P=39-210 \"39-210\")39-245 Rapid Prototype DesignAll Semesters: 9 units This course provides an introduction to rapid design through virtual and physical prototyping. The class covers the engineering design process, problem solving methods, interdisciplinary team work, current industrial p...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "39-250",
    "title": "CIT Undergraduate ProjectsFall",
    "department": "College of Engineering",
    "description": "This course number is to be used for Fall CIT freshman research projects only. Student must complete a CIT Undergraduate Project Approval form (located in Scaife Hall 110) and submit for approval. The form must include a complete description and a signature approval from the research advisor/instructor. If the project is approved, the CIT Undergraduate Studies Office will add the course to the student's fall schedule.",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "39-251",
    "title": "CIT Undergraduate ProjectsSpring",
    "department": "College of Engineering",
    "description": "This course number is to be used for Spring CIT freshman research projects only. Student must complete a CIT Undergraduate Project Approval form (located in Scaife Hall 110) and submit for approval. The form must include a complete description and a signature approval from the research advisor/instructor. If the project is approved, the CIT Undergraduate Studies Office will add the course to the student's fall schedule.",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "39-310",
    "title": "Experiential Learning IIIFall and Spring",
    "department": "College of Engineering",
    "description": "The engineer of the 21st century will need to operate effectively in many settings and often with a global perspective. Being curious and constantly looking for inspiration are critical for lifelong learning. This course, designed for all CIT juniors, requires the student to choose and experience activities for development and growth that are not part of formal course work. Acceptable experiences are listed in the course syllabus on Canvas. Prerequisite: [39-220](http://coursecatalog.web.cmu.edu/search/?P=39-220 \"39-220\")39-402 Leadership Development SeminarAll Semesters: 9 units This course is designed for CIT seniors and juniors committed to further developing their leadership skills and potential for sustained impact in the future. The course will be substantive and engaging, while less...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "39-447",
    "title": "CIT Undergraduate Interdisciplinary Design ProjectAll Semesters",
    "department": "College of Engineering",
    "description": "This course is to be used for undergraduate research projects involving a significant interdisciplinary design component. It can be added by permission only through collaboration with the student, project advisor, and the CIT Dean's Office. For projects that are not interdisciplinary in nature, students should refer to the research number specific to the department in which the research is being completed.",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "39-500",
    "title": "CIT Honors Research ProjectAll Semesters",
    "department": "College of Engineering",
    "description": "Juniors who have an accumulated QPA of at least 3.5 receive an invitation to participate in the program. This course, open by invitation only, will provide the opportunity for close interaction with a faculty member through independent honors research in a number of disciplinary and interdisciplinary areas, as part of the CIT Honors Research Program. Students will work on their projects during their senior year, earning the equivalent of 18-24 units. Students are required to register for CIT Honor Research Project [39-500](http://coursecatalog.web.cmu.edu/search/?P=39-500 \"39-500\"). To receive CIT College Honors, a student must complete at least 18 units in [39-500](http://coursecatalog.web.cmu.edu/search/?P=39-500 \"39-500\") on the same research topic and submit a 1-page executive summary ...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "39-602",
    "title": "Additive Manufacturing and MaterialsFall and",
    "department": "College of Engineering",
    "description": "This course will develop the understanding required for materials science and engineering for additive manufacturing. The emphasis will be on powder bed machines for printing metal parts, reflecting the research emphasis at CMU. The full scope of methods in use, however, will also be covered. The topics are intended to enable students to understand which materials are feasible for 3D printing. Accordingly, high power density welding methods such as electron beam and laser welding will be discussed, along with the characteristic defects. Since metal powders are a key input, powder-making methods will be discussed. Components once printed must satisfy various property requirements hence microstructure-property relationships will be discussed because the microstructures that emerge from the i...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "39-603",
    "title": "Additive Manufacturing LaboratorySpring: 12 units",
    "department": "College of Engineering",
    "description": "Hands-on laboratory projects will teach students about all aspects of metals additive manufacturing (AM). Students will learn how to use SOLIDWORKS for part design, create and transfer design files to the AM machines, run the machines to build parts, perform post-processing operations, and characterize AM parts. Student will work in teams and complete three separate lab projects, each utilizing a different material system, part design, AM process/machine, post-processing steps and characterization methods. A major lab report and presentation will be required for each of the three lab projects. The course includes weekly lectures to complement the laboratory component. Priority for enrollment will be given to students who have declared the Additive Manufacturing Minor. Prerequisites: [39-60...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "39-606",
    "title": "Engineering Design ProjectsSpring: 12 units",
    "department": "College of Engineering",
    "description": "In this project course, students work in multidisciplinary teams to design products or processes. The course is open to juniors, seniors and graduate students from all parts of the campus community. Each project is sponsored by an industry, government or non-profit partner, and is of real commercial interest to that partner. Students work directly with their partner throughout the semester to establish goals and requirements, evaluate their design as it progresses, and produce a final report, presentation, and, if appropriate, a prototype. Design reviews, held twice during the semester, give students a chance to present their preliminary designs and receive feedback and advice. In completing their designs, teams must consider not only the functionality of their designs, but also the look, ...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "39-647",
    "title": "Special Topics in DesignAll Semesters",
    "department": "College of Engineering",
    "description": "This course is to be use for Interdisciplinary Engineering Design Independent Study. It can be added by permission only through collaboration with the student, Independent Study project advisor, and the CIT Dean's Office.",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "39-648",
    "title": "Rapid Prototyping of Computer SystemsSpring: 12 units",
    "department": "College of Engineering",
    "description": "This course deals with rapid prototyping, manufacture, and applications of a new generation of wearable computers, with head-mounted display. The design of wearable computers is a multidisciplinary process including: Electronic design, mechanical design, software development, and human-computer interaction. Two classes of wearable computers will be further developed: embedded, custom designed VuMan series, and general purpose Navigator series. Electronic design includes the custom designed computer board, electronic interfacing, and power supply. Industrial designers and mechanical engineers team to design and manufacture with in-house facilities a variety of conformable/lightweight housings. A software development environment and user interface builders support software and application de...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "62-002",
    "title": "CFA ElectiveIntermittent: 9 units",
    "department": "College of Fine Arts",
    "description": "TBA",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "62-106",
    "title": "Architecture and the ArtsFall: 9 units",
    "department": "College of Fine Arts",
    "description": "This interdisciplinary course explores the entangled relationship between architecture and the arts, and their struggle between autonomy and engagement. It will be structured around a series of themes, drawings, and writings that reveal architecture's constantly changing involvement with art, culture, society, and related disciplines The course functions both an introduction to Architecture as Art for a general audience, as well as a critical introduction to architectural thinking and theory for architecture majors. The course will include slide lectures, readings, reading reports, discussions, and a series of research exercises to engage architecture and art more critically, and an exam. We'll examine the common roots, disparate characters, and inter-twined histories of architecture and t...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "62-122",
    "title": "Digital Media IFall: 6 units",
    "department": "College of Fine Arts",
    "description": "This course will engage in an overview of foundational workflows in digital media regarding two-dimensional representation techniques for spatial design processes. The course is divided into two topics with one assignment each: Technical Drawing and 2D Graphics. Students are required to submit work at the end of each class, in addition to self-guided work outside of class times: satisfactory completions of the two assignments, specific Lynda tutorials, final project, and final portfolio are required for the successful completion of the course. Through these deliverables, the course will inquire issues of 2D representation as it pertains to the effective communication of technical and conceptual information in spatial design processes. With digital media, designers now have an arsenal of to...",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "62-138",
    "title": "Photographic Lighting TechniquesFall and",
    "department": "College of Fine Arts",
    "description": "This half semester studio will introduce students to a variety of photographic lighting techniques, conceptual approaches, equipment, and technical applications. Students will work with natural and artificial lighting across a range of photographic methods, applying their learned skills to still life, portraiture, landscape, street photography, and reportage. Thisclasswill teach students to work with various types of lighting equipment and situations in the field and in the studio. Regular in classdemos, lectures, and critiques will introduce equipment and concepts. A lab fee is charged for this course.",
    "units": 5,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "62-139",
    "title": "Photography as Meditation: A Walking Photographic PracticeFall and",
    "department": "College of Fine Arts",
    "description": "This half semester studiocoursewill explore the ways in which walking and photography intersect as a meditative practice to benefit creative work. Students will be introduced to these approaches through a series of readings, photographic prompts, lectures, and excursions. Thisclasswill consider walking in both literal and metaphoric forms. Students will use the contemplative act and slowed pace of a walk to create images of their surroundings. They will also work with walking as a conceptual approach for the examination of archives and as an aid for image editing and sequencing. A lab fee is charged for this course.",
    "units": 5,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "62-140",
    "title": "Images in Space: Photographic Objects, Materiality, and InstallationFall and",
    "department": "College of Fine Arts",
    "description": "This course explores the relationship between photography and dimensionality. We will review different frameworks for how photographs interact in physical space, including photographic objects, installations, and materialities. Students will explore these themes through weekly presentations, discussions, assignments, writing workshops, and critiques. We'll look at artists who think critically about photography as it relates to these ideas. This class will encourage experimental methods and approaches to photography. A lab fee is charged for this course.",
    "units": 10,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "62-141",
    "title": "Black and White Photography IFall and",
    "department": "College of Fine Arts",
    "description": "This course will teach you the basic craft of photography from exposure of the negative through darkroom developing and printing to print finishing and presentation. Content includes student presentations, class discussions, shooting assignments, darkroom sessions and class critiques. We will concentrate not only on the technical aspects of photography, but also the aesthetics of seeing with a camera. The course concentrates on photography as a fine art and #8212; what is unique to it and the concerns that are shared with other visual arts, such as composition, tonal values, etc. and aims to equip students with an understanding of the formal issues and the expressive potentials of the medium. Use your own 35 mm camera, or borrow one from us for the semester. Students are responsible for th...",
    "units": 10,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "62-142",
    "title": "Digital Photography IFall and",
    "department": "College of Fine Arts",
    "description": "This course explores digital photography and digital printing methods. By semester's end students will have knowledge of contemporary trends in photography, construction (and deconstruction) of photographic meaning, aesthetic choices, and the use of color. Students will learn how digital cameras work, proper digital workflow, RAW file handling, color management and Adobe Photoshop. Through the combination of the practical and theoretical, students will better define their individual voices as photographers. No prerequisites. A lab fee is charged for this course.",
    "units": 10,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "62-150",
    "title": "IDeATe Portal: Introduction to Media Synthesis and AnalysisFall: 10 units",
    "department": "College of Fine Arts",
    "description": "Technologists, artists, and designers are engaging in new, interdisciplinary modes to consume, create, and reuse media. To do this, they thoughtfully collaborate and critically reflect on media creation, distribution, participation, interaction, and how media affects the audience. In this course, students will challenge themselves to work in these new modal contexts by thinking critically in a genre of exploration. They will formulate the intent of their creative work, articulate relationships to art/design practice and theory, and respond insightfully to creative, media-rich outcomes. The class will introduce core concepts through foundational texts, in-class exercises, collaborative projects, and group critique. Through hands-on media exploration, students will ground concepts such as em...",
    "units": 10,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "62-241",
    "title": "Black and White Photography IIFall and",
    "department": "College of Fine Arts",
    "description": "Black and White Photography II continues developing your technical skills in analog photography by introducing medium and large format cameras and prints. Large format view cameras remain the state of the art in control and quality in both film and digital photography. These cameras as well as unusual panoramic and pinhole cameras will be supplied. This course emphasizes aesthetic development and personal artistic growth through individual tutorials and group critiques, and will help to build professional level photography skills. Additional topics include digital printing and negative scanning, advanced monotone printing methods, and a focus on exhibition and folio presentation. Students are responsible for the cost of photo paper and film, and a lab fee is charged for the course. Prerequ...",
    "units": 10,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "62-247",
    "title": "Introduction to Hot Glass IFall and",
    "department": "College of Fine Arts",
    "description": "In this introductory class, learn to gather clear molten glass from the furnace and then shape it into various forms, from paperweights to simple blown shapes, such as cups and bowls. Instruction focuses on a team approach to glassblowing, with an emphasis on safety, proper tool use, basic techniques, and materials. You'll never drink from a glass again without appreciating the energy and detail that went into making it! Little to no hot shop experience is required. You may also wish to take this class a second time in order to continue to develop and refine basic skills before moving on to Hot Glass 2. Each time you take it, your skill level, confidence, and passion for glass will grow. Hot Shop Open Studio time is purposefully included with this 8-week course to give students independent...",
    "units": 3,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "62-314",
    "title": "The Art of Personal FinanceFall and",
    "department": "College of Fine Arts",
    "description": "Money is an inevitable part of our everyday lives. Managing the money we earn and living within our means is essential to ensure that we have the freedom to do what we want to do with our lives. However, even if we successfully eliminate debt and save for the future, true financial freedom will not exist unless we have a plan to guide us on our way. In this course, students will create a simple one-page financial plan that they can use to guide them through their next several years as they cultivate the skills that will ensure their artistic success. Additionally, they will develop the tools needed to support the execution of the plan and create a sourcebook of information they can refer to in the future as their lives (and their financial plans) change.",
    "units": 6,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "62-315",
    "title": "Shaping Environments: Experiments in Geometry and (Waste)MatterFall",
    "department": "College of Fine Arts",
    "description": "Shaping Environments is a design-research seminar that explores alternative material formations beyond our current petrochemical reality. Using digital environments and computational tools, such as photogrammetry, depth-map texture modeling, AI workflows, and 3D printing, we will experiment with shaping new hybrid material systems. Using resources, such as food and/or construction waste, our goal is to propose new material paradigms that embrace ecological thinking and environmental stewardship through physical prototyping.",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "62-343",
    "title": "Professional Practices in PhotographyFall and",
    "department": "College of Fine Arts",
    "description": "This studio course will introduce students to the working methods of professional photographers and artists. For the first half of the course, students will develop a substantial body of visual work. They will then use that work in the second half of the semester to produce portfolios across a variety of media (digital, print, web, exhibition, etc.). Throughout the process they will develop skills in constructing and completing projects, cultivate their personal vision and aesthetic tastes, explore methods of disseminating their work to larger audiences, establish time management and planning around long form projects, and acquire an understanding of the marketing, outreach and community building necessary for working artists to build and sustain a career. Prerequisites: [62-141](http://co...",
    "units": 10,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "62-362",
    "title": "IDeATe: Electronic Logics && Creative PracticeIntermittent: 12 units",
    "department": "College of Fine Arts",
    "description": "Electronic Logics and amp; and amp; Creative Practice investigates the fundamentals of electronic computation as metaphors for art and interaction. Students explore technology through a creative lens, as conceptual and physical material to be manipulated and synthesized, by examining the basis of digital computation alongside contemporary and new media art practices. There are three main units: Gates (the logical building blocks of computers), Flow (ways in which signals \"flow\" through physical and electronic systems), and Arrows (the stacked layers of indirection used in modern computer systems). These major themes are addressed through lecture, readings, and the creation of individual and collaborative works. Throughout the semester students complete a series of quick thematic exercises ...",
    "units": 12,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "62-371",
    "title": "Photography, The First 100 Years, 1839-1939Fall: 9 units",
    "department": "College of Fine Arts",
    "description": "Photography was announced to the world almost simultaneously in 1839, first in France and then a few months later in England. Accurate \"likenesses\" of people were available to the masses, and soon reproducible images of faraway places were intriguing to all. This course will explore the earliest image-makers Daguerre and Fox Talbot, the Civil War photographs organized by Mathew Brady, the introduction in 1888 of the Kodak by George Eastman, the critically important social documentary photography of Jacob Riis and his successor, Lewis Hine, the Photo-Secession of Alfred Stieglitz, the Harlem Renaissance of James VanDerZee, the precisionist f64 photographers Ansel Adams, Imogen Cunningham, and Edward Weston, and other important photographers who came before World War II. The class will be in...",
    "units": 9,
    "prerequisites": [],
    "learning_outcomes": []
  },
  {
    "course_id": "62-423",
    "title": "IDeATe: Advanced Physical ComputingFall: 10 units",
    "department": "College of Fine Arts",
    "description": "This project-based IDeATe interdisciplinary course is structured around the design and fabrication of a novel piece of assistive technology for a local person living with a disability. Students will work on teams to interview their client, ideate prospective interventions, prototype iteratively with client feedback, and finally, build a fully realized functional device to be given to the client for long-term use. The course addresses intermediate/advanced technical topics in the realm of physical computing. Learning is driven in part by project needs, and may include: PCB design, how to specify electronic components, 3D computer-aided design (CAD) for digital fabrication, and how to fabricate more mechanically and electrically robust final products. Each student team is expected to open-so...",
    "units": 10,
    "prerequisites": [],
    "learning_outcomes": []
  }
]